Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: Queries beyond specified size will not be saved in the history when executed. Set to 0 to save any executed query or script
ru: Запросы сверх указанного размера не будут сохранены в истории при выполнении. Установите в 0 для сохранения любого выполняемого запроса или скрипта

source: Continue SQL script execution on errors (by default)
ru: Продолжить выполнение SQL-скрипта при ошибках (по умолчанию)

source: Whether to continue skipping failed SQL statements when running a script.
ru: Продолжать ли пропускать неудачные SQL операторы при запуске скрипта.

source: New connections use auto commit mode
ru: В новых соединениях используется режим автокоммита

source: Sets the default autocommit mode for connections. When enabled, each statement will be committed immediately. NOTE: all query tabs in the same connection share the same transaction. To have independent transactions, you must open a new connection.
ru: Устанавливает режим автокоммита для соединений по умолчанию. Когда включено, каждый оператор будет совершен немедленно. ПРИМЕЧАНИЕ: все вкладки запросов в одном и том же соединении имеют одинаковую транзакцию. Чтобы совершить независимые транзакции, вы должны открыть новое соединение.

source: Progress status update interval (in milliseconds):
ru: Интервал обновления статуса (в мс):

source: Time interval between UI updates when running SQL script.
ru: Интервал времени между обновлениями интерфейса при запуске SQL-скрипта.

source: SELECT Query Results
ru: ВЫБЕРИТЕ результаты запросов

source: Whether every select query to be implicitly adjusted to limit result set to specified number of rows by appending the LIMIT keyword to the query. If enabled it's still possible to load entire result set by pressing "Fetch All" button.
ru: Каждый ли выбранный запрос может быть настроен на ограничение результирующего количества строк, добавив к запросу ключевое слово LIMIT. Если включено, возможно загрузить весь результирующий набор нажатием кнопки "Извлечь все".

source: Limit Rows Count:
ru: Количество строк:

source: Every select query to be implicitly adjusted to limit result set to specified number of rows.
ru: Каждый выделенный запрос настраивается на ограничение результирующего количества строк.

source: Max. Field Value Length to Display (in bytes):
ru: Макс. длина отображения значения поля (в байтах):

source: Symbols beyond specified threashold will be truncated when showing in the grid. Doesn't affect editing field values. Set to -1 to disable truncation.
ru: Символы за пределами указанной тригонометрии будут усечены при показе в таблице. Не влияет на изменение значений поля. Установите значение -1 для отключения усечения.

source: Treat BINARY/VARBINARY as nonbinary character string
ru: Считать BINARY/VARBINARY небинарным символом

source: Whether to treat binary byte strings as nonbinary character strings. Binary byte string values do not appear in results grid and are marked as a BLOB values that are supposed to be viewed/edited by means of BLOB editor. Nonbinary character string values are shown right in results grid and can be edited with either cell's in-place editor or BLOB editor. Warning: Since binary byte strings tend to contain zero-bytes in their values, turning this option on may lead to data truncation when viewing/editing. Note: Application restart is needed to get new option value in affect.
ru: Является ли обработка бинарных байтовых строк не бинарными символами. Двоичные значения строк не отображаются в таблице результатов и помечаются как BLOB значения, которые должны быть просмотрены/отредактированы при помощи BLOB редактора. Значения символьных строк Nonbinary отображаются в сетке результатов и могут быть отредактированы либо с помощью редактора ячейки на месте, либо с помощью BLOB. Предупреждение: Поскольку бинарные байтовые строки содержат нулевые байты в их значениях, включение этой опции может привести к усечению данных при просмотре / редактировании. Примечание: Перезагрузка приложения необходима для получения значения новой опции.

source: Confirm Data Changes
ru: Подтвердите изменения данных

source: Whether to show a dialog confirming changes to be made to a table recordset.
ru: Показывать диалог, подтверждающий изменения в наборе таблиц.

source: Preserve Row Filter
ru: Сохранение строк фильтра

source: If set, keep row filter active on result set changes. Otherwise the filter is reset.
ru: Если установлено, удерживайте фильтр строк активным при изменении результирующего множества. Иначе фильтр сброшен.

source: Automatically reopen previous model at start
ru: Автоматически переоткрывать предыдущую модель в начале

source: Force use of software based rendering for EER diagrams
ru: Принудительно использовать программное обеспечение на основе рендеринга для EER диаграмм

source: Enable this option if you have drawing problems in Workbench modeling. You must restart Workbench for the option to take effect.
ru: Включите этот параметр, если у вас возникли проблемы в Workbench моделировании. Для применения этой опции необходимо перезапустить Рабочий стол.

source: Model undo history size:
ru: Размер истории отмены:

source: Allowed values are from 1 up. Note: using high values (> 100) will increase memory usage and slow down operation.
ru: Допустимые значения от 1 до 1. Примечание: использование высоких значений (> 100) увеличит использование памяти и замедлит ее работу.

source: Auto-save model interval:
ru: Интервал автосохранения:

source: Interval to perform auto-saving of the open model. The model will be restored from the last auto-saved version if Workbench unexpectedly quits.
ru: Интервал автосохранения открытой модели. Модель будет восстановлена из последней автосохраненной версии, если Workbench неожиданно завершится.

source: Timeouts
ru: Таймаут

source: Determines how long the process waits for connection until timeout
ru: Определяет, как долго процесс ждет соединения до таймаута

source: SSH Connect Timeout:
ru: Тайм-аут подключения SSH:

source: SSH connect timeout in seconds.
ru: Таймаут подключения SSH в секундах.

source: Determines how long the process waits for i/o
ru: Определяет, как долго процесс ждет i/o

source: SSH Read Write Timeout:
ru: SSH время чтения записи:

source: SSH Read/Write Timeout in seconds.
ru: Тайм-аут чтения/записи SSH в секундах.

source: Determines how long the process waits for a command output. This is also affected by SSH Command Retry Count.
ru: Определяет, как долго процесс ждет вывода команд. Это также влияет на количество повторов команд SSH.

source: SSH Command timeout:
ru: Тайм-аут команды SSH:

source: SSH Command Timeout in second.
ru: Тайм-аут SSH команды в секунду.

source: Determines how many times we should retry reading command output after specified SSH Command Timeout option.
ru: Определяет, сколько раз мы должны повторить чтение вывода команд после указанного параметра SSH Command Timeout.

source: SSH Command Retry Count:
ru: Количество повторов команд SSH:

source: SSH Command Retry count.
ru: Количество повторов команд SSH.

source: Buffer size used for tunnel data transfer
ru: Размер буфера для передачи данных туннеля

source: SSH BufferSize:
ru: Размер буфера:

source: SSH buffer size in bytes.
ru: Размер буфера SSH в байтах.

source: Size used to limit transfering of big files
ru: Размер для ограничения передачи больших файлов

source: SSH Maximum File Size:
ru: Максимальный размер SSH файла:

source: The maximum file that is allowed to be transfered by SSH.
ru: Максимальный файл, который может быть передан SSH.

source: Size used to limit transfering of big command output log.
ru: Размер, используемый для ограничения передачи журнала вывода больших команд.

source: SSH Command Execution log:
ru: Журнал выполнения SSH команды:

source: The maximum log size that is allowed to be transfered by SSH.
ru: Максимальный размер журнала, который может быть передан SSH.

source: Path to SSH config file:
ru: Путь к файлу конфигурации SSH:

source: Specifiy the full path to the SSH config file.
ru: Укажите полный путь к файлу конфигурации SSH.

source: Path to SSH known hosts file:
ru: Путь к SSH файлу узлов:

source: Specifiy the full path to the SSH known hosts file.
ru: Укажите полный путь к SSH известному хост-файлу.

source: Home Screen
ru: Домашний экран

source: Show Welcome Message on Connections Screen
ru: Показать приветственное сообщение на экране подключения

source: The interval in seconds before connection is aborted.
ru: Интервал в секундах до прекращения подключения.

source: Migration Connection Timeout:
ru: Тайм-аут подключения миграции:

source: Maximum time to wait before a connection is aborted.
ru: Максимальное время ожидания для остановки соединения.

source: URL location to display geometry point:
ru: URL местоположения для отображения точки геометрии:

source: Allow more than one instance of MySQL Workbench to run
ru: Разрешить запускать более одного экземпляра MySQL Workbench

source: By default only one instance of MySQL Workbench can run at the same time. This is more resource friendly and necessary as multiple instances share the same files (settings etc.). Change at your own risk.
ru: По умолчанию только один экземпляр MySQL Workbench может запускаться одновременно. Это более удобный для использования ресурс, так как несколько экземпляров имеют общие файлы (настройки и т.д.). Измените на свой страх и риск.

source: Logs
ru: Логи

source: Log level determines how serious a message has to be before it gets logged. For example, an error is more serious than a warning, a warning is more serious than an info, etc. So if log level is set to error, anything less serious (warning, info, etc) will not be logged. If log level is set to warning, both warning and error will still be logged, but info and anything lower will not. None disables all logging.
ru: Уровень записи в журнал определяет, насколько серьезным должно быть сообщение перед тем, как оно будет регистрироваться. Например, ошибка является более серьезной, чем предупреждение, предупреждение является более серьезным, чем информация и т.д. Таким образом, если уровень журнала установлен на ошибку, то все менее серьезные (предупреждение, информация и т.д. ) не будут регистрироваться. Если в логе установлен уровень предупреждения, то и предупреждение и ошибка будут регистрироваться, но информация и ничего ниже не будет. Никто не отключает все журналы.

source: Log Level
ru: Уровень журнала

source: Sets the "chattyness" of logs. Choices further down the list produce more output than the ones that preceed them.
ru: Устанавливает "chattyness" журналов.

source: Column Defaults
ru: Столбец по умолчанию

source: PK Column Name:
ru: Название столбца PK:

source: Substitutions: %table% - name of the table May be used as %table|upper%, %table|lower%, %table|capitalize%, %table|uncapitalize%
ru: Замены: %table% - имя таблицы Может использоваться как %table|upper%, %table|lower%, %table|capitalize%, %table|uncapitalize%

source: PK Column Type:
ru: Тип столбцов PK:

source: Default type for use in newly added primary key columns. Specify a column type name or a user defined type. Flags such as UNSIGNED are not accepted.
ru: Тип по умолчанию для использования в вновь добавленных столбцах первичных ключей. Укажите имя типа столбца или тип определенного пользователя. Флаги, такие как UNSIGNED, не принимаются.

source: Column Name:
ru: Название столбца:

source: Substitutions: %table% - name of the table
ru: Замены: %table% - название таблицы

source: Column Type:
ru: Тип столбцов:

source: Default type for use in newly added columns. Specify a column type name or a user defined type. Flags such as UNSIGNED are not accepted.
ru: Тип по умолчанию для использования в вновь добавленных столбцах. Укажите имя столбца или тип определенного пользователя. Флаги, такие как UNSIGNED, не принимаются.

source: Foreign Key/Relationship Defaults
ru: Внешние ключи/отношения по умолчанию

source: FK Name:
ru: Имя FK:

source: Substitutions: %table%, %stable% - name of the source table %dtable% - name of the destination table (where FK is added) %column%, %scolumn% - name of the source column %dcolumn% - name of the destination column May be used as %table|upper%, %table|lower%, %table|capitalize% or %table|uncapitalize%
ru: Замены: %table%, %stable% - имя исходной таблицы %dtable% - имя таблицы назначения (где добавлено FK) %column%, %scolumn% - имя исходного столбца %dcolumn% - название столбца назначения Может использоваться как %table|верхний%, %table|lower%, %table|capitalize% или %table|uncapitalize%

source: ON UPDATE:
ru: ОБНОВИТЬ:

source: ON DELETE:
ru: УДАЛИТЬ:

source: Associative Table Name:
ru: Название ассоциативной таблицы:

source: Substitutions: %stable% - name of the source table %dtable% - name of the destination table
ru: Замены: %stable% - имя таблицы источника %dtable% - имя таблицы назначения

source: for n:m relationships
ru: для отношений n:m

source: Model
ru: Модель

source: Default Target MySQL Version:
ru: Целевая версия MySQL по умолчанию:

source: Model Table Defaults
ru: Модель таблицы по умолчанию

source: Default Storage Engine:
ru: Двигатель по умолчанию:

source: Forward Engineering and Synchronization
ru: Перенаправить инжиниринг и синхронизация

source: SQL_MODE to be used in generated scripts:
ru: SQL_РЕЖИМ для использования в сгенерированных скриптах:

source: The default value of ONLY_FULL_GROUP_BY, STRICT_TRANS_TABLES, NO_ZERO_IN_DATE, NO_ZERO_DATE, ERROR_FOR_DIVISION_BY_ZERO, NO_ENGINE_SUBSTITUTION is recommended.
ru: По умолчанию рекомендуется значение ONLY_FULL_GROUP_BY, STRICT_TRANS_TABLES, NO_ZERO_IN_DATE, NO_ZERO_DATE, ERROR_FOR_DIVISION_BY_ZERO, NO_ENGINE_SUBSTITUTION .

source: All Objects
ru: Все объекты

source: Expand New Objects
ru: Развернуть новые объекты

source: Set the initial state of newly created objects to expanded (or collapsed)
ru: Установить начальное состояние вновь созданных объектов для разворачивания (или свернутого)

source: Propagate Object Color Changes to All Diagrams
ru: Распространение изменений цвета объектов во всех чертежах

source: If an object figure's color is changed, all figures in all diagrams that represent the same object are also updated
ru: Если цвет фигуры объекта изменяется, все фигуры на всех диаграммах, представляющих один и тот же объект также обновляются

source: Show Column Types
ru: Показать типы столбцов

source: Show the column types along their names in table figures
ru: Типы столбцов по их именам в фигурах таблицы

source: Show Schema Name
ru: Показать имя схемы

source: Show owning schema name in the table titlebar figures
ru: Показывать имя схемы владения в заголовках таблицы

source: Max. Length of ENUMs and SETs to Display:
ru: Макс. длина ENUMs и SET'ов для отображения:

source: Show Column Flags
ru: Показать флаги столбца

source: Show column flags such as NOT NULL or UNSIGNED along their names in table figures
ru: Показывать флаги столбца, такие как НЕ НУЛО или НЕИЗВЕСТНО по их именам в цифрах таблицы

source: Larger tables will be truncated.
ru: Большие столы будут усечены.

source: Max. Number of Columns to Display:
ru: Макс. количество столбцов для отображения:

source: Routines
ru: Процедуры

source: Trim Routine Names Longer Than
ru: Обрезать рутинные имена длиннее, чем

source: characters
ru: символы

source: Relationships/Connections
ru: Отношения / Соединения

source: Draw Line Crossings (slow in large diagrams)
ru: Нарисуйте пересечения линии (медленно на больших диаграммах)

source: Show Captions
ru: Показать субтитры

source: Center Captions Over Line
ru: Центрировать субтитры через строку

source: Color Presets
ru: Пресеты цветов

source: Colors available when creating tables, views etc
ru: Цвета доступны при создании таблиц, представлений и т.д.

source: Colors available when creating layers, notes etc
ru: Цвета доступны при создании слоев, заметок и т.д.

source: Location
ru: Местоположение

source: SQL Editor:
ru: Редактор SQL:

source: Global font for SQL text editors
ru: Глобальный шрифт для текстовых редакторов SQL

source: Resultset grid in SQL Editor
ru: Сетка результатов в SQL редакторе

source: Scripting Shell:
ru: Оболочка скрипта:

source: Scripting Shell output area
ru: Область вывода оболочки скриптов

source: Script Editor:
ru: Редактор сценариев:

source: Code editors in scripting shell
ru: Редакторы кода в скриптовой оболочке

source: Color Scheme
ru: Цветовая схема

source: Select your scheme:
ru: Выберите схему:

source: The scheme that determines the core colors.
ru: Схема определения основных цветов.

source: updating references to schema: `%s` -> `%s`
ru: обновление ссылок на схему: `%s` -> `%s`

source: Started %s.
ru: Начато %s.

source: Finished %s.
ru: Завершено %s.

source: Totally processed statements: successful (%i), errors (%i), warnings (%i).
ru: Полностью обработанные операторы: успешные (%i), ошибки (%i), предупреждения (%i).

source: Creating foreign key references...
ru: Создание внешних ссылок...

source: Finished parsing MySQL SQL script.
ru: Завершена разбор MySQL SQL-скрипта.

source: Autolayout Model '
ru: Модель автоаута '

source: Create Diagram with Objects
ru: Создать диаграмму с помощью объектов

source: Create Diagram with Catalog
ru: Создать диаграмму с помощью каталога

source: Center Model
ru: По центру модели

source: Include Model
ru: Включить модель

source: Detected Changes
ru: Обнаружены изменения

source: Detected Changes to be Applied to Destination
ru: Обнаружены изменения, которые будут применены к назначению

source: Applying Alter Progress
ru: Обработка процесса обработки

source: Alter Progress
ru: Изменить прогресс

source: Connect to DBMS
ru: Подключиться к СУБД

source: Connecting to DBMS...
ru: Подключение к СУБД...

source: Execute Alter Script
ru: Выполнить обработку скрипта

source: Applying Alter engineered SQL script in DBMS...
ru: Использование скрипта Alter разработанного SQL в DBMS...

source: Read Back Changes Made by Server
ru: Читать обратные изменения, сделанные сервером

source: Fetching back object definitions reformatted by server...
ru: Получение обратных определений объектов по серверу...

source: Applying Alter Finished Successfully
ru: Заявка на изменение успешно завершена

source: Update Destination
ru: Обновить адрес назначения

source: Update the database/script with changes detected in the source.
ru: Обновление базы данных/скрипта с обнаруженными в исходном коде изменениями.

source: Source Database
ru: Исходная база данных

source: Source Database with detected changes.
ru: База данных с обнаруженными изменениями.

source: Ignore the change.
ru: Игнорировать изменения.

source: Update the database/script with changes.
ru: Обновить базу данных/скрипт с изменениями.

source: Differences Found
ru: Различия найдены

source: Synchronize With Any Source
ru: Синхронизировать с любым исходным кодом

source: Set Options for Synchronization Script
ru: Установить параметры скрипта синхронизации

source: Sync Options
ru: Настройки синхронизации

source: Generation Options
ru: Параметры генерации

source: Compare Options
ru: Сравнить параметры

source: Skip synchronization of Triggers
ru: Пропустить синхронизацию триггеров

source: Skip synchronization of Stored Procedures and Functions
ru: Пропустить синхронизацию сохраненных процедур и функций

source: Skip checking of Routine Definer
ru: Пропустить проверку определения рутины

source: Omit Schema Qualifier in Object Names
ru: Omit Schema Qualifier в Именах Объектов

source: Include SQL Scripts Attached to Model
ru: Включить SQL скрипты, подключенные к модели

source: Preview Database Changes to be Applied
ru: Предварительный просмотр изменений базы данных для применения

source: Review DB Changes
ru: Просмотреть изменения в БД

source: Progress of Model and Database Synchronization
ru: Прогресс по модели и синхронизации базы данных

source: Synchronize Progress
ru: Синхронизировать прогресс

source: Apply Changes to Database
ru: Применить изменения к базе данных

source: Applying selected changes from model to the database...
ru: Применение выбранных изменений из модели в базу данных...

source: Apply Changes to Model
ru: Применить изменения к модели

source: Applying selected changes from database to the model...
ru: Применение выбранных изменений из базы данных в модель...

source: Synchronization Completed Successfully
ru: Синхронизация успешно завершена

source: Model and Database Differences
ru: Различия в модели и базе данных

source: Set Options for Database to be Created
ru: Установить параметры для создания базы данных

source: Other Objects
ru: Другие объекты

source: Code Generation
ru: Генерация кода

source: Skip creation of FOREIGN KEYS
ru: Пропустить создание КЛАВИШИ

source: Skip creation of FK Indexes as well
ru: Пропустить создание индексов FK

source: Generate separate CREATE INDEX statements
ru: Создать отдельные операторы CREATE INDEX

source: Generate INSERT statements for tables
ru: Создать вывод INSERT для таблиц

source: Disable FK checks for INSERTs
ru: Отключить проверку FK для INSERT

source: Don't create view placeholder tables
ru: Не создавать шаблонные таблицы

source: Do not create users. Only create privileges (GRANTs)
ru: Не создавать пользователей. Создавать только привилегии (GRANTs)

source: DROP objects before each CREATE object
ru: DROP объекты перед каждым объектом CREATE

source: Generate DROP SCHEMA
ru: Сгенерировать DROP SCHEMA

source: Omit schema qualifier in object names
ru: Квалификатор схемы Omit в именах объектов

source: Generate USE statements
ru: Создать USE-операторы

source: Add SHOW WARNINGS after every DDL statement
ru: Добавить ПОКАЗЫВАТЬ ПРЕДУПРЕЖДЕНИЯ после каждого оператора DDL

source: Include model attached scripts
ru: Включить прилагаемые скрипты

source: Select Objects
ru: Выбрать объекты

source: Select Objects to Forward Engineer
ru: Выберите объекты для пересылки инженера

source: To exclude objects of a specific type from the SQL Export, disable the corresponding checkbox. Press Show Filter and add objects or patterns to the ignore list to exclude them from the export.
ru: Чтобы исключить объекты определенного типа из SQL Export, отключите соответствующий флажок. Нажмите Show Filter и добавьте объекты или шаблоны в список игнорирования, чтобы исключить их из экспорта.

source: Export %s Objects
ru: Экспорт %s объектов

source: Review the SQL Script to be Executed
ru: Просмотрите SQL-скрипт для выполнения

source: This script will now be executed on the DB server to create your databases. You may make changes before executing.
ru: Этот скрипт будет запущен на сервере БД для создания баз данных. Вы можете внести изменения перед выполнением.

source: Forward Engineering Progress
ru: Прогресс Форсаж Инженера

source: Commit Progress
ru: Прогресс коммита

source: Execute Forward Engineered Script
ru: Выполнить форвардный скрипт

source: Executing forward engineered SQL script in DBMS...
ru: Выполнение forward спроектированного SQL скрипта в DBMS...

source: Save Synchronization State
ru: Сохранить состояние синхронизации

source: Storing state information to synchronization profile...
ru: Сохранение информации о состоянии для профиля синхронизации...

source: Forward Engineer Finished Successfully
ru: Успешное завершение форвардного инженера

source: Forward Engineer to Database
ru: Передать инженера в базу данных

source: Choose Direction to Apply Changes
ru: Выберите направление для применения изменений

source: Select Changes to Apply
ru: Выберите изменения для применения
