Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: Create a new SQL tab for executing queries
ru: Создать новую вкладку SQL для выполнения запросов

source: Open a SQL script file in a new query tab
ru: Открыть файл сценария SQL в новой вкладке запроса

source: Save SQL Script to a New File
ru: Сохранить SQL-скрипт в новый файл

source: Open Inspector for the selected object
ru: Открыть инспектор для выбранного объекта

source: Create a new schema in the connected server
ru: Создать новую схему на подключенном сервере

source: Create a new table in the active schema in connected server
ru: Создать новую таблицу в активной схеме на подключенном сервере

source: Create a new view in the active schema in the connected server
ru: Создать новый вид в активной схеме на подключенном сервере

source: Create a new stored procedure in the active schema in the connected server
ru: Создать новую хранимую процедуру в активной схеме на подключенном сервере

source: Create a new function in the active schema in the connected server
ru: Создать новую функцию в активной схеме на подключенном сервере

source: Search table data for text in objects selected in the sidebar schema tree
ru: Поиск данных таблицы для текстовых объектов выбранных в дереве схемы боковой панели

source: Reconnect to DBMS
ru: Переподключиться к СУБД

source: Show preferences dialog
ru: Показать диалог настроек

source: Toggle Schema Sidebar
ru: Схема боковой панели

source: Toggle Output Area
ru: Переключить область вывода

source: Toggle Secondary Sidebar
ru: Включить/выключить вторичную боковую панель

source: _File
ru: _Файл

source: _New Query Tab...
ru: _Создать вкладку запроса...

source: New Query Tab
ru: Вкладка Новый Запрос

source: _Open Model...
ru: _Открыть модель...

source: _Include Model...
ru: _Включить модель...

source: _Open SQL Script...
ru: _Открыть сценарий SQL...

source: Open _Recent
ru: Открыть _недавние

source: _Close Connection Tab
ru: _Закрыть вкладку подключения

source: _Close Tab
ru: _Закрыть вкладку

source: _Save Model
ru: _Сохранить модель

source: _Save Script
ru: Сохранить _скрипт

source: Save Model _As...
ru: Сохранить _модель как...

source: Save Script _As...
ru: Сохранить _сценарий как...

source: Revert to Saved
ru: Вернуться к сохраненным

source: _Import
ru: _Импорт

source: _Export
ru: _Экспорт

source: Forward Engineer SQL CREATE Script...
ru: Forward Engineer SQL CREATE скрипт...

source: Export as PNG...
ru: Экспорт в PNG...

source: Export as SVG...
ru: Экспортировать как SVG...

source: Export as Single Page PDF...
ru: Экспортировать в один PDF-документ...

source: Export as Single Page PostScript File...
ru: Экспорт в один PostScript-файл страницы...

source: Page Setup...
ru: Настройка страницы...

source: Print Preview...
ru: Предпросмотр печати...

source: Print to File...
ru: Печать в файл...

source: Document Properties...
ru: Свойства документа...

source: E_xit
ru: _Выход

source: _Edit
ru: _Изменить

source: Undo
ru: Отменить

source: Redo
ru: Повторить

source: Cut
ru: Вырезать

source: Copy
ru: Копировать

source: Paste
ru: Вставить

source: Remove Figure
ru: Удалить фигуру

source: Delete
ru: Удалить

source: Edit Selected
ru: Изменить выбранное

source: Edit Selected in New Window
ru: Изменить выбранное в новом окне

source: Select
ru: Выбрать

source: Select All
ru: Выделить все

source: Similar Figures
ru: Похожие фигуры

source: Connected Figures
ru: Связанные фигуры

source: Select Next Placeholder
ru: Выбрать следующую метку

source: Find
ru: Найти

source: Find...
ru: Найти...

source: Find and Replace
ru: Найти и Заменить

source: Format
ru: Формат

source: Beautify Query
ru: Очистка запросов

source: UPCASE Keywords
ru: Ключевые слова UPCASE

source: lowercase Keywords
ru: ключевые слова нижнего регистра

source: Un/Comment Selection
ru: Выбор/Комментарий

source: Preferences...
ru: Настройки...

source: _View
ru: _Вид

source: Home
ru: Домашний

source: Panels
ru: Панели

source: Show Secondary Sidebar
ru: Показать вторичную боковую панель

source: Show Output Area
ru: Показать область вывода

source: Windows
ru: Окна

source: Model Navigator
ru: Модель Навигатора

source: Catalog
ru: Каталог

source: Layers
ru: Слои

source: User Datatypes
ru: Типы данных пользователя

source: Object Descriptions
ru: Описание объекта

source: Object Properties
ru: Свойства объекта

source: Undo History
ru: Отменить историю

source: Reset Window Layout
ru: Сбросить макет окна

source: Toggle Full Screen
ru: Полноэкранный режим

source: Select Next Query Tab
ru: Выбрать следующую вкладку запроса

source: Select Previous Query Tab
ru: Выбрать предыдущий запрос вкладки

source: Select Next Main Tab
ru: Выбрать следующую главную вкладку

source: Select Previous Main Tab
ru: Выбрать предыдущую главную вкладку

source: Set Marker
ru: Установить маркер

source: Set Marker 1
ru: Установить маркер 1

source: Set Marker 2
ru: Установить маркер 2

source: Set Marker 3
ru: Установить маркер 3

source: Set Marker 4
ru: Установить маркер 4

source: Set Marker 5
ru: Установить маркер 5

source: Set Marker 6
ru: Установить маркер 6

source: Set Marker 7
ru: Установить маркер 7

source: Set Marker 8
ru: Установить маркер 8

source: Set Marker 9
ru: Установить маркер 9

source: Go To Marker
ru: Перейти к маркеру

source: Go to Marker 1
ru: Перейти к маркеру 1

source: Go to Marker 2
ru: Перейти к маркеру 2

source: Go to Marker 3
ru: Перейти к маркеру 3

source: Go to Marker 4
ru: Перейти к маркеру 4

source: Go to Marker 5
ru: Перейти к маркеру 5

source: Go to Marker 6
ru: Перейти к маркеру 6

source: Go to Marker 7
ru: Перейти к маркеру 7

source: Go to Marker 8
ru: Перейти к маркеру 8

source: Go to Marker 9
ru: Перейти к маркеру 9

source: _Arrange
ru: _Упорядочить

source: Expand All
ru: Развернуть все

source: Collapse All
ru: Свернуть все

source: _Model
ru: _Модель

source: Add Diagram
ru: Добавить диаграмму

source: Create Diagram from Catalog Objects
ru: Создать диаграмму из объектов каталога

source: User Defined Types...
ru: Определенные пользователем типы...

source: Table Templates...
ru: Шаблоны таблиц...

source: DBDoc - Model Reporting...
ru: DBDoc - Отчет по моделям...

source: Validation (MySQL)
ru: Проверка (MySQL)

source: Validate All
ru: Проверить все

source: Check Integrity
ru: Проверить целостность

source: Check Syntax
ru: Проверить синтаксис

source: Check for Empty Content
ru: Проверить на пустой контент

source: Check Table Efficiency
ru: Проверьте эффективность таблиц

source: Check Duplicated Identifiers
ru: Проверять дублирующиеся идентификаторы

source: Check Consistency
ru: Проверить соответствие

source: Check Logic Errors
ru: Проверить логические ошибки

source: Object Notation
ru: Нотация объекта

source: Workbench (Default)
ru: Рабочий стол (по умолчанию)

source: Workbench (Simplified)
ru: Рабочий стол (упрощенный)

source: Workbench (PKs and FKs Only)
ru: Рабочий стол (только для PK)

source: Classic
ru: Классика

source: Relationship Notation
ru: Примечание отношения

source: Crow's Foot (IE)
ru: Голень Короны (IE)

source: Connect to Columns
ru: Подключение к столбцам

source: Diagram Properties and Size...
ru: Свойства и размер диаграммы...

source: Model Options...
ru: Опции модели...

source: _Query
ru: _Запрос

source: Execute (All or Selection)
ru: Выполнить (все или Выделение)

source: Execute (All or Selection) to Text
ru: Выполнить (все или выделенные) в текст

source: Execute Current Statement
ru: Выполнить текущую инструкцию

source: Execute Current Statement (Vertical Text Output)
ru: Выполнить текущее заявление (вертикальный вывод текста)

source: Explain Current Statement
ru: Объясните текущее заявление

source: _Stop
ru: _Стоп

source: Stop Script Execution on Errors
ru: Остановить выполнение скрипта при ошибках

source: Limit Rows
ru: Лимит строк

source: Collect Performance Schema Stats
ru: Сбор статистики эффективности

source: _Reconnect to Server
ru: _Переподключиться к серверу

source: _New Tab to Current Server
ru: _Новая вкладка на текущий сервер

source: Auto-Commit Transactions
ru: Автоматически совершать транзакции

source: C_ommit Transaction
ru: _Транзакция в Commit

source: _Rollback Transaction
ru: _Откат транзакции

source: Commit Result Edits
ru: Изменения результатов коммита

source: Discard Result Edits
ru: Отменить изменения результатов

source: _Export Results...
ru: _Экспорт результатов...

source: _Database
ru: _База данных

source: Connect to Database...
ru: Подключиться к базе данных...

source: Manage Connections...
ru: Управление подключениями...

source: Reverse Engineer...
ru: Инженер...

source: Forward Engineer...
ru: Передать инженер...

source: Schema Transfer Wizard...
ru: Мастер передачи схемы...

source: Migration Wizard...
ru: Мастер миграции...

source: Edit Type Mappings for Generic Migration...
ru: Редактировать типы карт для общей миграции...

source: Synchronize Model...
ru: Синхронизировать модель...

source: Synchronize with Any Source...
ru: Синхронизировать с любым исходным кодом...

source: Compare Schemas...
ru: Сравнить схемы...

source: Search Table Data...
ru: Поиск данных таблицы...

source: _Server
ru: _Сервер

source: Server Status
ru: Статус сервера

source: Client Connections
ru: Соединения с клиентами

source: Users and Privileges
ru: Пользователи и привилегии

source: Status and System Variables
ru: Статус и системные переменные

source: Data Export
ru: Экспорт данных

source: Data Import
ru: Импорт данных

source: Startup/Shutdown
ru: Запустить/Выключить

source: Server Logs
ru: Журналы сервера

source: Options File
ru: Файл настроек

source: Dashboard
ru: Панель

source: Performance Reports
ru: Отчеты о производительности

source: Performance Schema Setup
ru: Настройка схемы производительности

source: Audit Log Inspector
ru: Инспектор журнала аудита

source: Firewall
ru: Брандмауэр

source: MySQL Enterprise Backup
ru: Резервная копия MySQL Enterprise

source: Backup Recovery
ru: Восстановление резервной копии

source: Management Access Settings...
ru: Настройки доступа...

source: Reset Saved Passwords for Connection
ru: Сброс сохраненных паролей для подключения

source: _Tools
ru: _Инструменты

source: Browse Audit Log File...
ru: Просмотр файла журнала аудита...

source: Configuration
ru: Конфигурация

source: Backup Connections...
ru: Резервное копирование подключений...

source: Restore Connections...
ru: Восстановить соединения...

source: _Scripting
ru: _Скрипт

source: Scripting Shell
ru: Оболочка скриптов

source: New Script...
ru: Новый скрипт...

source: Open Script...
ru: Открыть скрипт...

source: Run Script File
ru: Запустить файл скрипта

source: Run Workbench Script File...
ru: Запустить файл скрипта Workbench...

source: Install Plugin/Module...
ru: Установить плагин/модуль...

source: _Help
ru: _Помощь

source: Help Index
ru: Справочный индекс

source: Show License Info
ru: Показать информацию о лицензии

source: MySQL Workbench Documentation
ru: Документация по MySQL Workbench

source: MySQL Workbench Blog
ru: Блог MySQL Workbench

source: MySQL Workbench Forums
ru: Форумы MySQL Workbench

source: MySQL.com Website
ru: Сайт MySQL.com

source: Oracle Support
ru: Поддержка Oracle

source: Report a Bug
ru: Сообщить об ошибке

source: Locate Log Files
ru: Найти файлы журнала

source: Show Log File
ru: Показать файл журнала

source: Check for Updates
ru: Проверить обновления

source: About Workbench
ru: О рабочем столе

source: Add new Diagram
ru: Добавить новую диаграмму

source: Show GRT Shell IDE
ru: Показать GRT Shell IDE

source: Search for object in selected model
ru: Поиск объекта в выбранной модели

source: Toggle Sidebar
ru: Переключить боковую панель

source: Draw Background
ru: Нарисовать фон

source: Add new Schema
ru: Добавить новую схему

source: Add new Table
ru: Добавить новую таблицу

source: Add new View
ru: Добавить новый вид

source: Add new Routine
ru: Добавить новую процедуру

source: Letter (8.5 in. x 11 in.)
ru: Буква (8.5 дюйм х 11 в.)

source: Legal (8.5 in. x 14 in.)
ru: Юридические требования (8,5 дюйма х 14 дюйма)

source: Folio (8.5 in. x 13 in.)
ru: Фолио (8,5 дюйма x 13 дюйма)

source: A4 (210 mm x 297 mm)
ru: A4 (210 мм х 297 мм)

source: A5 (148 mm x 210 mm)
ru: A5 (148 мм х 210 мм)

source: B4 (250 mm x 353 mm)
ru: B4 (250 мм х 353 мм)

source: B5 (176 mm x 250 mm)
ru: B5 (176 мм х 250 мм)

source: Executive (7.5 in. x 10.5 in.)
ru: Исполнительный (7,5 дюйма х 10,5 дюйма)

source: Statement (5.5 in. x 8.5 in.)
ru: Заявление (5,5 в. х 8.5 в.)

source: A3 (297 mm x 420 mm)
ru: A3 (297 мм х 420 мм)

source: A2 (420 mm x 594 mm)
ru: A2 (420 мм х 594 мм)

source: A1 (594 mm x 841 mm)
ru: A1 (594 мм х 841 мм)

source: A0 (841 mm x 1189 mm)
ru: A0 (841 мм х 1189 мм)

source: ROC 16K (196 mm x 273 mm)
ru: ROC 16K (196 мм х 273 мм)

source: Tabloid (11 in. x 17 in.)
ru: Таблоид (11 дюйм х 17 дюймов)

source: Quarto (215 mm x 275 mm.)
ru: Квартал (215 мм х 275 мм)

source: ANSI C (432 mm x 559 mm.)
ru: ANSI C (432 мм x 559 мм)

source: ANSI D (559 mm x 864 mm.)
ru: ANSI D (559 мм x 864 мм)

source: ANSI E (864 mm x 1118 mm.)
ru: ANSI E (864 мм х 1118 мм)

source: Select Object(s)
ru: Выберите объект(ы)

source: Move Model
ru: Переместить модель

source: Delete Object
ru: Удалить объект

source: Place a New Text Object
ru: Разместить новый текстовый объект

source: Place a New Image
ru: Поместить новое изображение

source: Place a New Table
ru: Поставить новый стол

source: Place a New View
ru: Поставить новый вид

source: Place a New Routine Group
ru: Разместить новую рутинную группу

source: Place a New 1:1 Non-Identifying Relationship
ru: Разместить новый 1:1 Неидентифицирующее отношение

source: Place a New 1:n Non-Identifying Relationship
ru: Разместить новое соотношение 1:n

source: Place a New 1:1 Identifying Relationship
ru: Поставьте новый 1:1 Определение отношения

source: Place a New 1:n Identifying Relationship
ru: Поставьте новое значение 1:n

source: Place a New n:m Identifying Relationship
ru: Поставьте новый n:m Определение отношения

source: Place a Relationship Using Existing Columns
ru: Разместить взаимоотношения, используя существующие столбцы

source: A file with the selected name already exists, do you want to replace it?
ru: Файл с выбранным именем уже существует, вы хотите заменить его?

source: The file '%s' already exists. Replacing it will overwrite its contents.
ru: Файл '%s' уже существует. Замена его содержимого.

source: Replace
ru: Заменить

source: Cancel
ru: Отмена

source: Please select a connection
ru: Пожалуйста, выберите соединение

source: to open this script with.
ru: чтобы открыть этот скрипт.

source: Use Default
ru: Использовать по умолчанию

source: Models
ru: Модели

source: Enter a value
ru: Введите значение

source: OK
ru: ОК

source: Please enter password for the following service:
ru: Пожалуйста, введите пароль для следующей службы:

source: Service:
ru: Сервис:

source: User:
ru: Пользователь:

source: Password:
ru: Пароль:

source: Save password in vault
ru: Сохранить пароль в хранилище

source: Save password in keychain
ru: Сохранить пароль в связке ключей

source: Error Storing Password
ru: Ошибка при сохранении пароля

source: Error while loading image
ru: Ошибка при загрузке изображения

source: An error occured while loading image
ru: Произошла ошибка при загрузке изображения

source: Close
ru: Закрыть

source: Error while loading image data
ru: Ошибка при загрузке данных изображения

source: The data seems not to be valid.
ru: Данные не верны.

source: Don't show this message again
ru: Больше не показывать это сообщение

source: Error while copying to clipboard
ru: Ошибка при копировании в буфер обмена

source: passwords, hence you have to enter them again.
ru: пароли, поэтому вы должны ввести их снова.

source: Ignore
ru: Пропустить

source: Clear Vault
ru: Очистить хранилище

source: _Back
ru: _Назад

source: _Cancel
ru: _Отмена

source: _Next
ru: _Далее

source: Connections
ru: Соединения

source: < back
ru: < назад

source: MySQL Connections
ru: MySQL соединения

source: Connect to MySQL Server
ru: Подключиться к MySQL серверу

source: Initializing GRT...
ru: Инициализация GRT...

source: Initializing Workbench components...
ru: Инициализация компонентов рабочего стола...

source: Initialization Error
ru: Ошибка инициализации

source: There was an error during initialization of Workbench, some functionality may not work.
ru: Произошла ошибка во время инициализации Workbench, некоторые функциональности могут не работать.

source: Ready.
ru: Готово.

source: Invalid connection name '%s' given for --query
ru: Недопустимое имя подключения '%s' для --query

source: Error executing startup action
ru: Ошибка при выполнении действия запуска

source: An error occurred while the application executed the given startup action. The returned error is:
ru: Произошла ошибка при выполнении данного действия запуска. Возвращенная ошибка:

source: See also the output window.
ru: Смотрите также окно вывода.

source: The file is not a valid MySQL Workbench options file. The file will skipped and settings are reset to their default values.
ru: Файл не является допустимым файлом параметров MySQL Workbench. Файл будет пропущен и настройки будут сброшены к значениям по умолчанию.

source: Error while loading options
ru: Ошибка при загрузке параметров

source: The file is not a valid MySQL Workbench state file. The file will skipped and the application starts in its default state.
ru: Файл не является допустимым файлом состояния MySQL Workbench. Файл будет пропущен, и приложение запустится в его состоянии по умолчанию.

source: Error while loading application state
ru: Ошибка при загрузке состояния приложения

source: Creating new document...
ru: Создание нового документа...

source: New Document
ru: Новый документ

source: Only one model can be open at a time. Do you want to save pending changes to the document? If you don't save your changes, they will be lost.
ru: Одновременно можно открыть только одну модель. Вы хотите сохранить ожидающие изменения в документе? Если вы не сохраните изменения, они будут потеряны.

source: Save
ru: Сохранить

source: Don't Save
ru: Не сохранять

source: New document.
ru: Новый документ.

source: Error creating new document.
ru: Ошибка при создании нового документа.

source: Unrecognized File Type
ru: Нераспознанный тип файла

source: MySQL Workbench does not know how to open file %s
ru: MySQL Workbench не знает, как открыть файл %s

source: Cannot open document '%s'.
ru: Невозможно открыть документ '%s'.

source: Open Document
ru: Открыть документ

source: Only one model can be open at a time. Do you wish to save pending changes to the currently open model? If you don't they will be lost.
ru: Одновременно можно открыть только одну модель. Вы хотите сохранить ожидающие изменения в текущей открытой модели? Если вы не потеряете их.

source: Opening another model will close the currently open model. Do you wish to proceed opening it?
ru: Открытие другой модели закроет текущую открытую модель. Вы хотите продолжить ее открыть?

source: Open
ru: Открыть

source: Loading %s...
ru: Загрузка %s...

source: Model file is being loaded
ru: Файл модели загружается

source: The model %s is loading now and will be available in a moment. Please stand by...
ru: Модель %s загружается и будет доступна в данный момент. Пожалуйста, подождите...

source: Corrected Model File
ru: Исправлена модель файла

source: The model in file '%s' contained a problem which was successfully recovered: %s
ru: Модель в файле '%s' содержит проблему, которая была успешно восстановлена: %s

source: The model in file '%s' contained problems which were successfully recovered:
ru: Модель в файле '%s' содержит проблемы, которые были успешно восстановлены:

source: Document loaded.
ru: Документ загружен.

source: Close Document
ru: Закрыть документ

source: Do you want to save pending changes to the document? If you don't save your changes, they will be lost.
ru: Вы хотите сохранить ожидающие изменения в документе? Если вы не сохраните изменения, они будут потеряны.

source: Could not store document data.
ru: Не удалось сохранить данные документа.

source: Could not save document to %s
ru: Не удалось сохранить документ в %s

source: Save Model
ru: Сохранить модель

source: Saving %s...
ru: Сохранение %s...

source: %s saved.
ru: %s сохранено.

source: Error saving document.
ru: Ошибка при сохранении документа.

source: Error saving document
ru: Ошибка при сохранении документа

source: Cancelled.
ru: Отменено.

source: Performing %s...
ru: Выполняется %s...

source: Execution of "%s" finished.
ru: Выполнение "%s" завершено.

source: Activate Live Object
ru: Активировать живой объект

source: Connection cancelled
ru: Соединение отменено

source: Opening SQL Editor...
ru: Открытие SQL-редактора...

source: Connecting...
ru: Подключение...

source: Unsupported server
ru: Неподдерживаемый сервер

source: Could not open SQL Editor.
ru: Не удалось открыть SQL редактор.

source: Cannot Open SQL Editor
ru: Не удается открыть SQL редактор

source: Error in frontend for SQL Editor: %s
ru: Ошибка в интерфейсе для SQL редактора: %s

source: SQL Editor Opened.
ru: SQL редактор открыт.

source: Starting %s Module...
ru: Запуск %s модуля...

source: %s plugin not found
ru: Плагин %s не найден

source: Could not open %s: %s
ru: Не удалось открыть %s: %s

source: Add SQL Script File
ru: Добавить файл сценария SQL

source: Add Note File
ru: Добавить файл заметки

source: License Info
ru: Информация о лицензии

source: Starting Doc Lib
ru: Запуск Lib Doc

source: The MySQL Doc Library is opening currently, which should be finished in a moment . Please stand by...
ru: MySQL Doc Library открывается в настоящее время, которое должно быть завершено в данный момент. Пожалуйста, подождите...

source: Multiple Items
ru: Несколько элементов

source: <Multiple Items> That means not all selected items have same comment. Beware applying changes will override comments for all selected objects.
ru: <Multiple Items> Это означает, что не все выбранные элементы имеют одинаковый комментарий. Остерегайтесь применения изменения будут переопределить комментарии для всех выбранных объектов.

source: Set Object Description
ru: Установить описание объекта

source: Move To Group
ru: Переместить в группу

source: You must select the target group from the list or type a new group.
ru: Вы должны выбрать целевую группу из списка или ввести новую группу.

source: Ok
ru: Ок

source: The selected group is invalid, should not contain the "/" character.
ru: Выбранная группа неверна, не должна содержать символ "/".

source: Unable to perform the movement as there's an entry with the same name in the target group
ru: Невозможно выполнить движение, так как в целевой группе есть запись с таким же именем

source: Open Connection
ru: Открыть соединение

source: Edit Connection...
ru: Изменить соединение...

source: Move to Group...
ru: Переместить в группу...

source: Move To Top
ru: Переместить вверх

source: Move Up
ru: Переместить вверх

source: Move Down
ru: Вниз

source: Move To End
ru: Переместить в конец

source: Delete Connection...
ru: Удалить соединение...

source: Delete All Connections...
ru: Удалить все подключения...

source: Delete Group...
ru: Удалить группу...

source: Open Model
ru: Открыть модель

source: Show Model File
ru: Показать файл модели

source: Remove Model File from List
ru: Удалить файл модели из списка

source: Clear List
ru: Очистить список

source: Create EER Model from Database
ru: Создать модель EER из базы данных

source: Create EER Model from Script
ru: Создать EER модель из скрипта

source: Error while setting up home screen. The error message is: %s
ru: Ошибка при настройке домашнего экрана. Сообщение об ошибке: %s

source: Home Screen Error
ru: Ошибка домашнего экрана

source: Delete Connection
ru: Удалить соединение
