Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: If the currently connected server supports online DDL then use the selected lock as default. This setting can also be adjusted for each alter operation.
ru: Если подключенный в настоящее время сервер поддерживает онлайн-DDL, то используйте выбранную блокировку по умолчанию. Эта настройка также может быть изменена для каждой операции.

source: Applying SQL script to the database
ru: Применение SQL скрипта к базе данных

source: Apply SQL Script
ru: Применить SQL-скрипт

source: Execute SQL Statements
ru: Выполнить SQL-операторы

source: Executing SQL Statements...
ru: Выполнение SQL выражений...

source: SQL script was successfully applied to the database.
ru: SQL-скрипт успешно применен к базе данных.

source: There was an error while applying the SQL script to the database.
ru: Произошла ошибка при применении SQL-скрипта к базе данных.

source: Apply SQL Script to Database
ru: Применить SQL скрипт к базе данных

source: There are pending changes. Please commit or rollback first.
ru: Есть ожидающие изменения. Пожалуйста, сначала отмените или откат.

source: Close Recordset
ru: Закрыть запись

source: There are unsaved changes to the recordset data: %s. Do you want to apply them before closing?
ru: Имеются несохраненные изменения в данных набора записей: %s. Вы хотите применить их перед закрытием?

source: Don't Apply
ru: Не применять

source: Refresh Recordset
ru: Обновить Recordset

source: Rollback failed
ru: Откат не удался

source: Rollback recordset changes
ru: Откат изменений набора записей

source: Apply complete
ru: Заявка завершена

source: Applied but did not commit recordset changes
ru: Применено, но не зафиксировал изменения набора записей

source: Applied and commited recordset changes
ru: Применяемые и зафиксированные изменения набора записей

source: Error
ru: Ошибка

source: Cannot Advance
ru: Не удается продвинуться

source: Format:
ru: Формат:

source: Export Inserts Data to File
ru: Экспорт данных вставки в файл

source: Export Recordset
ru: Экспорт записи

source: Export
ru: Экспорт

source: Export options for %s
ru: Экспорт параметров для %s

source: Export Inserts Data
ru: Экспорт данных вставки

source: Add
ru: Добавить

source: Connect to Database
ru: Подключиться к базе данных

source: The following tasks will now be executed. Please monitor the execution. Press Show Logs to see the execution logs.
ru: Теперь будут выполнены следующие задачи. Пожалуйста, следите за выполнением. Нажмите Показать журналы, чтобы увидеть журналы выполнения.

source: Message Log
ru: Журнал сообщений

source: Operation has completed with errors. Please see logs for details.
ru: Операция завершена с ошибками. Подробности в журнале см.

source: Operation has completed with warnings. Please see logs for details.
ru: Операция завершена с предупреждениями. Подробности смотрите в журналах.

source: &Hide Logs
ru: &Скрыть журналы

source: &Show Logs
ru: &Показать логи

source: Hide Logs
ru: Скрыть журналы

source: Show Logs
ru: Показать логи

source: Select the schemas you want to include:
ru: Выберите схемы, которые вы хотите включать:

source: Input File
ru: Входной файл

source: Input SQL Script File:
ru: Входной файл сценария SQL:

source: Browse...
ru: Обзор...

source: Options
ru: Варианты

source: Place Imported Objects on a New Diagram
ru: Разместить импортированные объекты на новую диаграмму

source: Manage DB Connections
ru: Управление соединениями с БД

source: New
ru: Новый

source: Test Connection
ru: Проверить соединение

source: Stored Connections
ru: Сохраненные соединения

source: Press New to save these settings
ru: Нажмите Новый, чтобы сохранить эти настройки

source: Cannot Delete Connection
ru: Не удается удалить соединение

source: One or more Database Server Instances use this connection. You must remove them before deleting this connection.
ru: Один или несколько экземпляров сервера баз данных используют это соединение. Вы должны удалить их перед удалением этого соединения.

source: Save to File...
ru: Сохранить в файл...

source: Save the text to a new file.
ru: Сохранить текст в новый файл.

source: Copy to Clipboard
ru: Скопировать в буфер обмена

source: Copy the text to the clipboard.
ru: Копировать текст в буфер обмена.

source: Selected/Total Objects:
ru: Выбранные/Всего объектов:

source: Show Filter
ru: Показать фильтр

source: Objects to Process
ru: Объекты для процесса

source: Excluded Objects
ru: Исключенные объекты

source: Use the + button to exclude objects matching wildcards such as * and ?
ru: Используйте кнопку +, чтобы исключить объекты, соответствующие шаблонам, такие как * и ?

source: %i Total Objects, %i Selected
ru: %i всего объектов, выбрано %i

source: Hide Filter
ru: Скрыть фильтр

source: Results
ru: Результаты

source: Finish
ru: Закончить

source: _Close
ru: _Закрыть

source: Stored Connection:
ru: Сохраненное соединение:

source: Connection Name:
ru: Имя подключения:

source: Database System:
ru: База данных:

source: Connection Method:
ru: Метод соединения:

source: Select from saved connection settings
ru: Выбрать из сохраненных настроек подключения

source: Type a name for the connection
ru: Введите имя для подключения

source: Select a RDBMS from the list of supported systems
ru: Выберите RDBMS из списка поддерживаемых систем

source: Method to use to connect to the RDBMS
ru: Метод использования для подключения к RDBMS

source: Manage Stored Connections...
ru: Управление сохраненными подключениями...

source: Cannot Open Directory
ru: Не удается открыть каталог

source: The directory that should contain the files does not exist yet. Maybe you need to run the SSL Wizard first.
ru: Каталог, который должен содержать файлы, пока не существует. Возможно, вам необходимо сначала запустить мастер SSL.

source: Parameters
ru: Параметры

source: Advanced
ru: Расширенные

source: Cannot Set Password
ru: Не удается установить пароль

source: Please fill the username to be used.
ru: Пожалуйста, заполните имя пользователя для использования.

source: Store the password for this connection in a secured vault
ru: Сохранять пароль для этого подключения в защищенном хранилище

source: Store the password for this connection in the system's keychain
ru: Сохранять пароль для этого соединения в связке ключей системы

source: Remove the previously stored password from the secured vault
ru: Удалить сохраненный ранее пароль из защищенного хранилища

source: Remove the previously stored password from the system's keychain
ru: Удалить ранее сохраненный пароль из связки ключей системы

source: Character Set Encoding Name:
ru: Название кодировки набора символов:

source: Unknown File Encoding
ru: Неизвестная кодировка файла

source: Could not Convert Text Data
ru: Не удалось преобразовать текстовые данные

source: The file contents could not be converted from '%s' to UTF-8: %s
ru: Содержимое файла не может быть преобразовано из '%s' ' в UTF-8: %s

source: Choose Encoding
ru: Выберите кодировку

source: Some of the file contents could not be converted from '%s' to UTF-8: %s Click Ignore to open the partial file anyway, or choose another encoding.
ru: Некоторое содержимое файла не может быть преобразовано из '%s' ' в UTF-8: %s Кликните Игнорировать, чтобы открыть частичный файл, или выберите другую кодировку.

source: Clear
ru: Очистить

source: Loading struct definitions...
ru: Загрузка определений...

source: Looking for struct files in '%s'.
ru: Поиск файлов в '%s'.

source: Could not load structs from '%s': %s
ru: Не удалось загрузить структуры из '%s': %s

source: Registered %i GRT classes.
ru: Зарегистрировано %i GRT классов.

source: Initializing Loaders...
ru: Инициализация загрузчиков...

source: Failed initializing Loaders.
ru: Не удалось инициализировать загрузчиков.

source: Loading GRT library %s
ru: Загрузка библиотеки GRT %s

source: Loading modules...
ru: Загрузка модулей...

source: Python loader initialized.
ru: Загрузчик Python инициализирован.

source: Looking for modules in '%s'.
ru: Поиск модулей в '%s'.

source: Error scanning for modules: %s
ru: Ошибка при сканировании модулей: %s

source: %i modules found
ru: Найдено %i модулей

source: Registered %i modules (from %i files).
ru: Зарегистрировано %i модулей (из %i файлов).

source: Edit Object
ru: Изменить объект

source: No suitable editor found for object of type '%s'.
ru: Не найден подходящий редактор для объекта типа '%s'.

source: Change '%s'
ru: Изменить '%s ' '

source: Create a new file from a template
ru: Создать новый файл из шаблона

source: Open a script file
ru: Открыть файл скрипта

source: Save file
ru: Сохранить файл

source: Save file with a new name
ru: Сохранить файл с новым именем

source: Execute script
ru: Выполнить скрипт

source: Continue execution until next breakpoint
ru: Продолжить выполнение до следующей точки останова

source: Step to next statement
ru: Шаг до следующего утверждения

source: Step into next function
ru: Шаг до следующей функции

source: Finish execution of current function
ru: Завершить выполнение текущей функции

source: Stop executing script
ru: Остановить выполнение скрипта

source: Close this script tab
ru: Закрыть вкладку сценария

source: Clear script output
ru: Очистить вывод скрипта

source: Add a new snippet
ru: Добавить новый сниппет

source: Delete the selected snippet
ru: Удалить выбранный сниппет

source: Copy snippet text to the clipboard
ru: Копировать текст сниппета в буфер обмена

source: Copy Value
ru: Копировать значение

source: Copy Path
ru: Копировать путь

source: Copy Path for Python
ru: Скопировать путь для Python

source: Debugging
ru: Отладка

source: File Browser
ru: Файловый менеджер

source: Globals Tree
ru: Глобальное дерево

source: Classes List
ru: Список классов

source: Modules List
ru: Список модулей

source: Notifications
ru: Уведомления

source: Open GRT Script
ru: Открыть GRT скрипт

source: The file %s has an unsupported extension for this script editor.
ru: Файл %s имеет неподдерживаемое расширение для этого скриптового редактора.

source: Unsupported File Format
ru: Формат файла не поддерживается

source: Unsupported Execution
ru: Неподдерживаемое выполнение

source: This script editor is meant for developing Workbench plugins and scripts. SQL scripts should be opened and executed in the SQL Editor.
ru: Редактор скриптов предназначен для разработки плагинов Workbench и скриптов. SQL скрипты должны быть открыты и выполнены в SQL редакторе.

source: Delete File
ru: Удалить файл

source: Really delete '%s' from disk? This operation cannot be undone.
ru: Действительно удалить '%s' с диска? Эта операция не может быть отменена.

source: Introduction
ru: Введение

source: This dialog will help you to set up remote management for your connection. At the start a connection attempt is made to determine server version and operating system of the target machine. This allows you to validate the connection settings and allows the wizard to pick a meaningful configuration preset. If this attempt fails you can still continue, however. Continue to the next page to start the connection. This might take a few moments.
ru: Этот диалог поможет вам настроить удаленное управление подключением. При запуске делается попытка подключения для определения версии сервера и операционной системы целевой машины. Это позволяет вам проверить настройки соединения и позволяет мастеру выбрать подходящий пресет конфигурации. Если эта попытка не удается, вы все равно можете продолжить. Перейдите к следующей странице, чтобы начать подключение. Это может занять несколько минут.

source: Test DB Connection
ru: Проверка соединения с базой данных

source: Testing the Database Connection
ru: Проверка соединения с базой данных

source: The database connection information is being tested. This might take a few moments depending on your network connection.
ru: Идет тестирование информации о подключении к базе данных. Это может занять несколько минут в зависимости от вашего сетевого подключения.

source: Open Database Connection
ru: Подключение к базе данных

source: Connecting to database server...
ru: Подключение к серверу базы данных...

source: Get Server Version
ru: Получить версию сервера

source: Querying server version...
ru: Запрос версии сервера...

source: Get Server OS
ru: Получить ОС сервера

source: Querying server OS type...
ru: Запрос типа ОС сервера...

source: Database connection tested successfully.
ru: Соединение с базой данных проверено успешно.

source: Management and OS
ru: Управление и ОС

source: Select the type of remote management you want to use:
ru: Выберите тип дистанционного управления, который вы хотите использовать:

source: Native Windows remote management (only available on Windows)
ru: Удаленное управление Windows (доступно только для Windows)

source: SSH login based management
ru: Управление логином на основе SSH

source: Operating System Selection
ru: Выбор операционной системы

source: Select the operating system and the type of database installation on the target machine. If you configure a Linux target and you are unsure about the type of database installation select the (Vendor Package) variant. If your specific operating system is not in this list, select a related variant. It can later be customized, if needed.
ru: Выберите операционную систему и тип установки базы данных на целевой машине. Если вы настроили цель Linux и не уверены в типе установки базы данных, выберите вариант (Vendor Package). Если ваша конкретная операционная система отсутствует в этом списке, выберите соответствующий вариант. Позже она может быть изменена, если необходимо.

source: Operating System:
ru: Операционная система:

source: MySQL Installation Type:
ru: Тип установки MySQL:

source: Specify the installation type for your target operation system
ru: Укажите тип установки для целевой операционной системы

source: Specify remote management type and target operation system
ru: Укажите тип дистанционного управления и целевую операционную систему

source: MySQL installation type not selected
ru: Не выбран тип установки MySQL

source: SSH Configuration
ru: Настройки SSH

source: Set remote SSH configuration parameters
ru: Установить параметры конфигурации для удаленных SSH

source: In order to remotely configure this database instance an SSH account on this host with appropriate privileges is required. This account needs write access to the database configuration file, read access to the database logs and privileges to start/stop the database service/daemon.
ru: Для удаленной настройки экземпляра базы данных требуется учетная запись SSH на этом хосте с соответствующими привилегиями. Этой учетной записи требуется доступ на запись в конфигурационный файл базы данных, доступ на чтение в журналы базы данных и привилегии, чтобы начать/остановить сервис базы данных.

source: Host Name:
ru: Имя хоста:

source: Port:
ru: Порт:

source: User Name:
ru: Имя пользователя:

source: Authenticate Using SSH Key
ru: Аутентификация с помощью SSH ключа

source: SSH Private Key Path:
ru: SSH путь к закрытому ключу:

source: SSH Host Needed
ru: Требуется SSH хост

source: Please specify the host name or address.
ru: Пожалуйста, укажите имя или адрес хоста.

source: SSH User Name Needed
ru: Требуется имя пользователя SSH

source: Please specify the user name for the SSH account to be used.
ru: Пожалуйста, укажите имя пользователя для используемой учетной записи SSH.

source: Windows Management
ru: Управление Windows

source: Remote Windows management requires a user account on the remote machine which is allowed to connect remotely and also has the required privileges to query system status and to control services. For configuration file manipulation read/write access is needed to the file. Depending on your environment several ways of accessing that file are possible. Examples are mapped drives, network shares and administrative shares:
ru: Удаленное управление Windows требует учетной записи пользователя на удаленной машине, которая позволяет удаленно подключаться, а также имеет необходимые привилегии для запроса статуса системы и управления сервисами. Для работы с файлами конфигурации необходим доступ на чтение/запись файла. В зависимости от окружения возможны несколько способов доступа к этому файлу. Примерами являются отображенные диски, сетевые ресурсы и административные ресурсы:

source: M:\<path to file>\my.ini \\<server>\<share>\<path to file>\my.ini \\<server>\C$\Program Files\MySQL\MySQL Server 5.1\my.ini
ru: М:\<path to file>\my.ini \\<server>\<share>\<path to file>\my.ini \\<server>\C$\Program Files\MySQL\MySQL Server 5.1\my.ini

source: Initializing WMI, please wait...
ru: Инициализация WMI, пожалуйста подождите...

source: Select the service to manage from the list below. It will also help to find the configuration file.
ru: Выберите службу управления из списка ниже. Это также поможет найти файл конфигурации.

source: Path to Configuration File:
ru: Путь к файлу конфигурации:

source: Set remote Windows configuration parameters for host
ru: Установка параметров конфигурации удаленного Windows для узла

source: Remote Windows Login (%s)
ru: Удаленный вход в Windows (%s)

source: Please enter a Windows user login and password for the remote server with rights to WMI
ru: Пожалуйста, введите логин и пароль пользователя Windows для удаленного сервера с правами на WMI

source: Need valid user credentials to connect to server.
ru: Для подключения к серверу необходимы действительные учетные данные.

source: Windows management requires a user account on this machine which has the required privileges to query system status and to control services. For configuration file manipulation read/write access to the file is needed.
ru: Управление Windows требует учетной записи пользователя на этой машине, которая имеет необходимые привилегии для запроса статуса системы и управления сервисами. Для работы с файлом конфигурации необходим доступ на чтение/запись в файл.

source: Set Windows configuration parameters for this machine
ru: Установка параметров конфигурации Windows для этой машины

source: In order to manage a MySQL server it must be installed as a service. The wizard could not find any MySQL service on the target machine, hence the server instance cannot be created.
ru: Для управления сервером MySQL он должен быть установлен в качестве службы. Мастер не смог найти MySQL сервис на целевой машине, поэтому экземпляр сервера не может быть создан.

source: Could not set up connection: %s
ru: Не удалось настроить соединение: %s

source: Test Settings
ru: Тестовые настройки

source: Testing Host Machine Settings
ru: Тестирование настроек хост-машины

source: The connection to the host machine is being tested. This might take a few moments depending on your network connection.
ru: Проверяется подключение к машине хоста. Это может занять несколько минут в зависимости от вашего сетевого подключения.

source: Connect to host machine
ru: Подключиться к компьютеру

source: Trying to find host machine and connecting to it...
ru: Попытка найти хост-машину и подключиться к нему...

source: Check location of start/stop commands
ru: Проверка местоположения команд старта/стоп

source: Checking if commands to start and stop server are in the expected location...
ru: Проверяет, находятся ли в ожидаемом месте команды запуска и остановки сервера...

source: Check MySQL configuration file
ru: Проверка файла конфигурации MySQL

source: Looking for the configuration file of the database server...
ru: Поиск конфигурационного файла сервера базы данных...

source: Testing host machine settings is done.
ru: Тестирование настроек узла завершено.

source: Review settings
ru: Просмотр настроек

source: Checks succeeded for Connection and Configuration Settings for this new Server Instance.
ru: Проверка соединения и настроек сервера прошла успешно.

source: I'd like to review the settings again
ru: Я хочу снова просмотреть настройки

source: Review Settings
ru: Настройки обзора

source: Review Remote Management Settings
ru: Просмотр настроек удаленного управления

source: Below is a list of all settings collected so far. This includes also values taken from templates or default values. Check if they match your actual settings and toggle 'Change Parameters' if you need to make any changes to default values. For any other change go back to the appropriate wizard page. Pay special attention if you run more than one instance of MySQL on the same machine.
ru: Ниже приведен список всех настроек, собранных до настоящего времени, включая значения, взятые из шаблонов или по умолчанию. Установите флажок, если они соответствуют вашим фактическим настройкам и переключайте «Изменить параметры», если вам нужно внести какие-либо изменения в значения по умолчанию. Для любых изменений вернитесь на соответствующую страницу мастера. Особое внимание, если вы используете более одного экземпляра MySQL на той же машине.

source: SSH Based Adminstration enabled
ru: Администрирование на основе SSH включено

source: SSH host: %s:%s
ru: SSH хост: %s:%s

source: SSH user: %s
ru: SSH пользователь: %s

source: SSH key file: %s
ru: SSH файл: %s

source: Native Windows Adminstration enabled
ru: Родной администрирование Windows включено

source: Windows host: %s
ru: Хост Windows: %s

source: Windows user name: %s
ru: Имя пользователя Windows: %s

source: MySQL service name: %s
ru: Имя службы MySQL: %s

source: MySQL Version: %s
ru: Версия MySQL: %s

source: Settings Template: %s
ru: Шаблон настроек: %s

source: Path to Configuration File: %s
ru: Путь к файлу конфигурации: %s

source: Instance Name in Configuration File: %s
ru: Имя экземпляра в файле конфигурации: %s

source: Commands for MySQL Management
ru: Команды для управления MySQL

source: Use sudo: %s
ru: Используйте sudo: %s

source: Information about MySQL configuration
ru: Информация о конфигурации MySQL

source: In order to manage the settings of the MySQL Server it is necessary to know where its configuration file resides. The configuration file may consist of several sections, each of them belonging to a different tool or server instance. Hence it is also necessary to know which section belongs to the server we are managing. Please specify this information below.
ru: Для управления настройками MySQL Server необходимо знать, где находится конфигурационный файл. Конфигурационный файл может состоять из нескольких разделов, каждый из которых принадлежит другому инструменту или серверному экземпляру. Поэтому также необходимо знать, какой раздел принадлежит серверу, которому мы управляем. Пожалуйста, укажите эту информацию ниже.

source: MySQL Server Version:
ru: Версия MySQL сервера:

source: Check Path
ru: Проверить путь

source: Click to test if your path is correct.
ru: Щелкните, чтобы проверить, правильно ли ваш путь.

source: Section of the Server Instance:
ru: Раздел экземпляра сервера:

source: Check Name
ru: Имя чека

source: Click to test if your instance name is correct.
ru: Нажмите, чтобы проверить, правильно ли ваше имя экземпляра.

source: Click to test if your section is correct.
ru: Нажмите, чтобы проверить, правильно ли ваш раздел.

source: Invalid version
ru: Неверная версия

source: The MySQL server version number provided appears to be invalid.
ru: Неверный номер версии сервера MySQL.

source: Empty path
ru: Пустой путь

source: The path to the configuration must not be empty.
ru: Путь к конфигурации не должен быть пустым.

source: Empty section
ru: Пустой раздел

source: A section must be given which belongs to the given server.
ru: Необходимо указать раздел, который принадлежит данному серверу.

source: The config file path is valid.
ru: Путь к файлу конфигурации является допустимым.

source: The config file could not be found.
ru: Конфигурационный файл не найден.

source: The config file section is valid.
ru: Раздел конфигурации является допустимым.
