Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: Do you want to delete connection %s?
ru: Вы хотите удалить соединение %s?

source: Pick a group to move the selected connection to or type a name to move it to a new one.
ru: Выберите группу, чтобы переместить выбранное соединение к или введите имя, чтобы переместить его на новый.

source: Do you really want to delete all the connections in group: %s?
ru: Вы действительно хотите удалить все соединения в группе: %s?

source: Delete Connection Group
ru: Удалить группу подключений

source: Do you really want to delete all defined connections?
ru: Вы действительно хотите удалить все определенные соединения?

source: Delete All Connections
ru: Удалить все соединения

source: Do you want to remove all entries from the model list?
ru: Вы хотите удалить все записи из списка моделей?

source: Clear Model Entry List
ru: Очистить список записей модели

source: Starting %s
ru: Запуск %s

source: Please stand by while the plugin is started...
ru: Пожалуйста, подождите, пока запущен плагин...

source: Could not open link or plugin. The error message is: %s
ru: Не удалось открыть ссылку или плагин. Сообщение об ошибке: %s

source: Open Plugin Error
ru: Ошибка открытия плагина

source: Open Workbench Model
ru: Модель открытого рабочего стола

source: Wrong monitor format. Got '
ru: Неправильный формат монитора. Я. '

source: ', expected '<WMIClass.Name>'
ru: ', ожидается '<WMIClass.Name>'

source: WMI - Could not create monitor object.
ru: WMI - Не удалось создать объект монитора.

source: WMI - Invalid monitoring parameter specified.
ru: WMI - задан неверный параметр мониторинга.

source: WMI - Could not register monitoring enumerator.
ru: WMI - Не удалось зарегистрировать список мониторинга.

source: WMI setting security blanket failed.
ru: Сбой установки защитного одеяла WMI.

source: Could not connect to target machine.
ru: Не удалось подключиться к целевой машине.

source: WMI enumeration failed.
ru: Не удалось перечислить WMI.

source: Retry
ru: Повторить

source: Version %i.%i.%i build %i %s (%i bits)
ru: Версия %i.%i.%i сборка %i %s (%i бит)

source: Local
ru: Локальный

source: Local instance
ru: Локальный экземпляр

source: Unknown
ru: Неизвестен

source: Opening Document
ru: Открытие документа

source: Could not lock the document %s. The file is probably already opened in another instance of the application.
ru: Не удалось заблокировать документ %s. Файл уже открыт в другом экземпляре приложения.

source: Document Recovery
ru: Восстановление документа

source: The document %s was not properly closed in a previous session on %s. The file you're about to open was last saved %s. Would you like to use the recovered model? Continuing without recovering will remove the auto-saved data.
ru: Документ %s был закрыт неправильно в ходе предыдущей сессии по %s. Файл, который вы собираетесь открыть, был в последний раз сохранен %s. Вы хотите использовать восстановленную модель? Продолжение без восстановления удалит автоматически сохраненные данные.

source: Recover
ru: Восстановить

source: Continue
ru: Продолжить

source: Invalid model file content.
ru: Неверное содержимое файла модели.

source: Cannot create temporary directory for open document: %s
ru: Невозможно создать временный каталог для открытия документа: %s

source: Cannot open document file: %s
ru: Невозможно открыть файл документа: %s

source: Error opening document file: %s
ru: Ошибка открытия файла документа: %s

source: Error creating temporary directory while opending document.
ru: Ошибка при создании временного каталога во время установки документа.

source: Error creating temporary file while opending document.
ru: Ошибка при создании временного файла во время установки документа.

source: Error writing temporary file while opending document.
ru: Ошибка записи временного файла во время выбора документа.

source: Error writing zip file: %s
ru: Ошибка записи zip-файла: %s

source: Backup file is read-only
ru: Файл резервной копии доступен только для чтения

source: A backup file for this model already exists and must be removed, but is read only. Do you want to delete it anyway?
ru: Файл резервной копии для этой модели уже существует и должен быть удален, но только для чтения. Вы хотите удалить его?

source: Cannot change permission
ru: Невозможно изменить разрешение

source: The read-only state of the file: %s cannot be changed. Giving up - the model file will not be saved.
ru: Состояние файла, доступное только для чтения: %s не может быть изменено. Дача - файл модели не будет сохранен.

source: Model file is read-only
ru: Файл модели доступен только для чтения

source: The model file is read-only. Do you want to overwrite it anyway?
ru: Файл модели только для чтения. Все равно хотите перезаписать его?

source: Overwrite File
ru: Перезаписать файл

source: Execute privileged command
ru: Выполнить привилегированную команду

source: Open SSH Connection
ru: Открыть SSH соединение

source: Rename %s
ru: Переименовать %s

source: %i object(s) deleted.
ru: %i объект(ов) удалено

source: Could not delete selection.
ru: Не удалось удалить выбранное.

source: %i Selected Objects
ru: %i выбранных объектов

source: Cut %s
ru: Вырезать %s

source: %i object(s) cut.
ru: %i объект(ов).

source: %i object(s) copied.
ru: %i объект(ов) скопировано.

source: Paste %s
ru: Вставить %s

source: Delete %s
ru: Удалить %s

source: fetching...
ru: выборка...

source: could not be fetched
ru: не может быть загружен

source: Tables
ru: Таблицы

source: Views
ru: Просмотров

source: Stored Procedures
ru: Сохраненные процедуры

source: Functions
ru: Функции

source: Columns
ru: Столбцы

source: Indexes
ru: Индексы

source: Triggers
ru: Триггеры

source: Foreign Keys
ru: Внешние ключи

source: <b>Collation:</b>
ru: <b>Сравнение:</b>

source: <b>Definition:</b><table style="border: none; border-collapse: collapse;">
ru: <b>Определение:</b><table style="border: none; border-collapse: collapse;">

source: <b>Definition:</b><br>
ru: <b>Определение:</b><br>

source: <b>Columns:</b><table style="border: none; border-collapse: collapse;">
ru: <b>Столбцы:</b><table style="border: none; border-collapse: collapse;">

source: <div><b>Related Tables:</b></div>
ru: <div><b>Связанные таблицы:</b></div>

source: Unable to retrieve node description.
ru: Не удается получить описание узла.

source: Set as Default Schema
ru: Установить как схему по умолчанию

source: Filter to This Schema
ru: Фильтр по этой схеме

source: Select Rows
ru: Выберите строки

source: - Limit
ru: - Лимит

source: Refresh All
ru: Обновить все

source: Can't open SQL history directory
ru: Не удается открыть директорию истории SQL

source: Copy Row To Clipboard
ru: Скопировать строку в буфер обмена

source: Append Selected Items to SQL script
ru: Добавить выбранные элементы к SQL-скрипту

source: Replace SQL Script With Selected Items
ru: Заменить SQL-скрипт выбранными элементами

source: Result
ru: Результат

source: Export Resultset
ru: Результат экспорта

source: Export resultset canceled
ru: Экспорт набора результатов отменен

source: Exported resultset to %s
ru: Экспортировано значение %s

source: Call stored %s %s.%s
ru: Звонок сохранен %s %s.%s

source: Execute
ru: Выполнить

source: Enter values for parameters of your %s and click <Execute> to create an SQL editor and run the call:
ru: Введите значения параметров %s и нажмите <Execute> для создания SQL редактора и выполните вызов:

source: Close SQL Tab
ru: Закрыть вкладку SQL

source: SQL script %s has unsaved changes. Would you like to Save these changes before closing?
ru: SQL-скрипт %s имеет несохраненные изменения. Вы хотите сохранить эти изменения перед закрытием?

source: An edited recordset has unsaved changes in %s. Would you like to save these changes, discard them or cancel closing the page?
ru: Отредактированный набор записей имеет несохраненные изменения в %s. Вы хотите сохранить эти изменения, отменить их или отменить закрытие страницы?

source: Save Changes
ru: Сохранить изменения

source: There are %i recordsets with unsaved changes in %s. Would you like to save these changes, discard them or cancel closing to review them manually?
ru: Имеется %i наборов записей с несохраненными изменениями в %s. Вы хотите сохранить эти изменения, отменить их или отменить закрытие, чтобы просмотреть их вручную?

source: Save All
ru: Сохранить все

source: An error occurred while saving changes to the recordset %s %s
ru: Произошла ошибка при сохранении изменений в наборе записей %s %s

source: Save File As...
ru: Сохранить файл как...

source: Large File
ru: Большой файл

source: The file "%s" has a size of %.2f MB. Are you sure you want to open this large file? Note: code folding will be disabled for this file. Click Run SQL Script... to just execute the file.
ru: Файл "%s" имеет размер %.2f МБ. Вы уверены, что хотите открыть этот большой файл? Примечание: складка кода будет отключена для этого файла. Нажмите кнопку Run SQL Script... чтобы просто выполнить файл.

source: Run SQL Script...
ru: Запустить SQL-скрипт...

source: Save SQL Script
ru: Сохранить SQL-скрипт

source: Saving SQL script to '%s'...
ru: Сохранение SQL-скрипта в '%s'...

source: Error saving SQL script to '%s'.
ru: Ошибка при сохранении SQL-скрипта в '%s'.

source: Error writing file %s
ru: Ошибка записи файла %s

source: SQL script saved to '%s'
ru: Скрипт SQL сохранен в '%s'

source: Reverted to saved '%s'
ru: Восстановлено для сохранения '%s'

source: Open a script file in this editor
ru: Открыть файл скрипта в этом редакторе

source: Save the script to a file.
ru: Сохранить скрипт в файл.

source: Execute the selected portion of the script or everything, if there is no selection
ru: Выполнить выделенную часть скрипта или все, если не выделено

source: Execute the statement under the keyboard cursor
ru: Выполнить оператор под курсором клавиатуры

source: Execute the EXPLAIN command on the statement under the cursor
ru: Выполнить команду EXPLAIN под курсором

source: Stop the query being executed (the connection to the DB server will not be restarted and any open transactions will remain open)
ru: Остановить выполнение запроса (соединение с сервером БД не будет перезапущено, и все открытые транзакции останутся открытыми)

source: Toggle whether execution of SQL script should continue after failed statements
ru: Выберите, следует ли продолжать выполнение SQL-скрипта после неудачных выражений

source: Commit the current transaction. NOTE: all query tabs in the same connection share the same transaction. To have independent transactions, you must open a new connection.
ru: Зафиксировать текущую транзакцию. ПРИМЕЧАНИЕ: все вкладки запроса в одном и том же соединении имеют одну и ту же транзакцию. Чтобы иметь независимые транзакции, необходимо открыть новое соединение.

source: Rollback the current transaction. NOTE: all query tabs in the same connection share the same transaction. To have independent transactions, you must open a new connection.
ru: Откат текущей транзакции. ПРИМЕЧАНИЕ: все вкладки запросов в одном и том же соединении имеют одну и ту же транзакцию. Чтобы иметь независимые транзакции, необходимо открыть новое соединение.

source: Toggle autocommit mode. When enabled, each statement will be committed immediately. NOTE: all query tabs in the same connection share the same transaction. To have independent transactions, you must open a new connection.
ru: Вкл/Выкл режим автоподтверждения. Когда включено, каждый оператор будет совершен немедленно. ПРИМЕЧАНИЕ: все вкладки запросов в одном и том же соединении имеют одинаковую транзакцию. Чтобы иметь независимые транзакции, вы должны открыть новое соединение.

source: Set limit for number of rows returned by queries. Workbench will automatically add the LIMIT clause with the configured number of rows to SELECT queries.
ru: Установка лимита на количество строк, возвращаемых запросами. Рабочий стенд автоматически добавит оператор LIMIT с заданным количеством строк в SELECT запросы.

source: Save current statement or selection to the snippet list.
ru: Сохранить текущее утверждение или выделение в список сниппетов.

source: File %s %swas changed from outside MySQL Workbench. Would you like to discard your changes and reload it?
ru: Файл %s %sбыл изменен вне MySQL Workbench. Хотите отменить ваши изменения и перезагрузить его?

source: Rename Result Tab
ru: Переименовать вкладку Результат

source: Error Code: %i %s
ru: Код ошибки: %i %s

source: Error: %s
ru: Ошибка: %s

source: %%.%if sec
ru: %%%if сек

source: Could not connect to target database.
ru: Не удалось подключиться к целевой базе данных.

source: Could not Connect to Database Server
ru: Не удалось подключиться к серверу базы данных

source: Cannot Connect to Database Server
ru: Не удается подключиться к серверу базы данных

source: Connection restricted
ru: Соединение ограничено

source: Server Configuration Problems
ru: Проблемы конфигурации сервера

source: Get connection information
ru: Получить информацию о подключении

source: Running...
ru: Выполняется...

source: OK - Query cancelled
ru: OK - Запрос отменен

source: OK - Query already completed
ru: ОК - Запрос уже завершён

source: Executing Query...
ru: Выполнение запроса...

source: Query execution has been stopped, the connection to the DB server was not restarted, any open transaction remains open
ru: Выполнение запроса остановлено, соединение с сервером БД не было перезапущено, открытая транзакция остается открытой

source: Error Code: %i. %s Select the default DB to be used by double-clicking its name in the SCHEMAS list in the sidebar.
ru: Код ошибки: %i. %s Выберите базу данных по умолчанию для использования двойным щелчком по её имени в списке SCHEMAS в боковой панели.

source: Error Code: %i. %s To disable safe mode, toggle the option in Preferences -> SQL Editor and reconnect.
ru: Код ошибки: %i. %s Чтобы отключить безопасный режим, переключите опцию в Настройках -> SQL Editor и переподключите.

source: Error Code: %i. %s
ru: Код ошибки: %i. %s

source: %lli row(s) affected
ru: %lli строк(ов) затронуто

source: , %i warning(s):
ru: , %i предупреждение(я):

source: Maximum result count reached
ru: Достигнуто максимальное количество результатов

source: Fetching...
ru: Извлечение...

source: row(s) returned
ru: строка (ы) возвращена

source: Result set limit reached
ru: Достигнут лимит результатов

source: There were more results than result tabs could be opened, because the set maximum limit was reached. You can change this limit in the preferences.
ru: Было больше результатов, чем вкладки результата, так как достигнут максимальный лимит. Вы можете изменить это ограничение в настройках.

source: Query Completed
ru: Запрос завершен

source: Query interrupted
ru: Запрос прерван

source: Executing
ru: Выполнение

source: Apply Changes to Recordset
ru: Применить изменения к записи

source: Autocommit is currently disabled and a transaction might be open. Recordset changes will be applied within that transaction and will be left uncommited until you explicitly commit it manually. If you want it to be executed separately, click Cancel and commit the transaction first.
ru: Autocommit в настоящее время отключен, и транзакция может быть открыта. Изменения набора записей будут применены в этой транзакции и не будут запятыми, пока вы явно не подтвердите их принять. Если вы хотите, чтобы он выполнялся отдельно, нажмите кнопку Отмена и сначала зафиксируйте транзакцию.

source: Apply
ru: Применить

source: Apply changes to recordset
ru: Применить изменения к записям

source: Applying changes to %s...
ru: Применение изменений в %s...

source: Applying changes...
ru: Применение изменений...

source: Apply ALTER script for %s
ru: Применить ALTER скрипт для %s

source: Changes applied to %s
ru: Изменения применены к %s

source: Active schema was cleared
ru: Активная схема была очищена

source: Active schema changed to %s
ru: Активная схема изменена на %s

source: Set active schema
ru: Установить активную схему

source: Cannot close SQL IDE while being busy
ru: Невозможно закрыть ID SQL, пока занят

source: Restore snippet list
ru: Восстановить список сниппетов

source: You are about to restore the "%s" snippet list to its original state. All changes will be lost. Do you want to continue?
ru: Вы собираетесь восстановить список фрагментов "%s" до его первоначального состояния. Все изменения будут потеряны. Вы хотите продолжить?

source: Administration
ru: Администрация

source: Information
ru: Информация

source: Object Info
ru: Информация о объекте

source: Session
ru: Сессия

source: Search Objects in Server
ru: Поиск объектов на сервере

source: To enable searching objects in the remote server, MySQL Workbench needs to create a stored procedure in a custom schema (%s).
ru: Чтобы включить поиск объектов на удалённом сервере, MySQL Workbench должен создать хранимую процедуру в пользовательской схеме (%s).

source: Create
ru: Создать

source: The user %s has no privileges to create the required schema and stored procedures to enable remote search in this server. Ensure your database administrator creates a schema for internal use of MySQL Workbench with full privileges for the user %s, once created configure it in Preferences->General->Internal Workbench Schema and retry. %s.
ru: Пользователь %s не имеет привилегий для создания необходимой схемы и сохраненных процедур для включения удаленного поиска на этом сервере. Убедитесь, что администратор базы данных создаст схему внутреннего использования MySQL Workbench с полными привилегиями для пользователя %s, настроив его в меню Preferences->General->Internal Workbench Schema и повторить попытку. %s.

source: Get schemata
ru: Получить схемы

source: Refresh live schema object
ru: Обновить живой объект схемы

source: The user %s has no privileges on %s to create temporal tables or execute required stored procedures used in remote search in this server. Ensure your database administrator grants you full access to the schema %s and retry. %s.
ru: Пользователь %s не имеет привилегий на %s для создания временных таблиц или выполнения необходимых хранимых процедур, используемых в удаленном поиске на этом сервере. Убедитесь, что администратор базы данных предоставил вам полный доступ к схеме %s и повторите попытку. %s.

source: Get data for filter
ru: Получить данные для фильтра

source: <b>Parameters:</b>
ru: <b>Параметры:</b>

source: Get schema contents
ru: Получить содержимое схемы

source: No Schema Selected
ru: Схема не выбрана

source: A default schema must be set by double clicking its name in the SCHEMA list.
ru: Схема по умолчанию должна быть установлена двойным щелчком по её названию в списке SCHEMA.

source: Failed to create/alter `%s`.`%s`
ru: Не удалось создать/изменить `%s`.`%s`

source: Error parsing sql code for object
ru: Ошибка разбора sql-кода для объекта

source: Get 'sql_mode' session variable
ru: Получить сессионную переменную 'sql_mode'

source: Error Parsing DDL for %s
ru: Ошибка разбора DDL для %s

source: The object's DDL retrieved from the server is inconsistent with respect to the SQL_MODE variable set for the connection. In particular the current state of the ANSI_QUOTES flag contradicts the value set when the object had been created. This may lead to errors when trying to apply changes. As a workaround you may want to temporarily change the SQL_MODE variable to its previous value. Do you want to view the DDL or cancel processing it?
ru: DDL объекта, полученного с сервера, несовместим с установленными для подключения переменными SQL_MODE. В частности, текущее состояние флага ANSI_QUOTES противоречит установленному в момент создания объекта. Это может привести к ошибкам при попытке применить изменения. В качестве обхода вы можете временно изменить переменную SQL_MODE на предыдущее значение. Вы хотите просмотреть DDL или отменить обработку?

source: View DDL
ru: Просмотр DDL

source: There was an error while parsing the DDL retrieved from the server. Do you want to view the DDL or cancel processing it?
ru: Произошла ошибка при разборе DDL полученных с сервера. Вы хотите просмотреть DDL или отменить обработку?

source: Apply changes to %s
ru: Применить изменения к %s

source: Apply Changes to Object
ru: Применить изменения к объекту

source: The object's DDL statement contains syntax errors. You cannot modify this object until you fix the errors.
ru: Операция DDL объекта содержит синтаксические ошибки. Вы не сможете изменить этот объект, пока не исправите ошибки.

source: The tables's trigger SQL code contains errors. This will lead to invalid sql generated. Are you sure you want to apply the DDL statement as is?
ru: Код триггера таблиц содержит ошибки. Это приведет к неправильному sql сгенерирован. Вы уверены, что хотите применить заявление DDL как есть?

source: Yes
ru: Да

source: No
ru: Нет

source: Selected name conflicts with existing %s `%s`.
ru: Выбранное имя конфликтует с существующим %s `%s`.

source: No changes to object were detected.
ru: Изменения к объекту не были обнаружены.

source: No changes detected
ru: Изменения не обнаружены

source: Create live table stub
ru: Создать заглушку живой таблицы

source: Limit to %i rows
ru: Лимит на %i строк

source: Don't Limit
ru: Не ограничивать

source: Limit to %i Rows
ru: Лимит до %i строк

source: SQL Additions
ru: SQL дополнения

source: Selection empty
ru: Выделение пустым

source: Select a schema, table or index object in the schema tree to show the inspector.
ru: Выберите схему, таблицу или объект индекса в дереве схемы, чтобы показать инспектору.

source: Changes applied
ru: Изменения применены

source: Export visible area as PNG image.
ru: Экспорт видимой области как PNG-изображения.

source: Save to File
ru: Сохранить в файл

source: Image has been succesfully saved to '%s'
ru: Изображение успешно сохранено в '%s'

source: Could not save to file '%s': %s
ru: Не удалось сохранить в файл '%s': %s

source: Insert Snippet at Cursor
ru: Вставить сниппет в курсор

source: Replace Editor Content with Snippet
ru: Заменить содержимое редактора сниппетом

source: Execute Snippet
ru: Выполнить сниппет

source: Copy Snippet to Clipboard
ru: Скопировать сниппет в буфер обмена

source: Edit Snippet
ru: Редактировать сниппет

source: Add Snippet from Editor Content
ru: Добавить сниппет из содержимого редактора

source: Delete Snippet
ru: Удалить сниппет

source: Restore Original Snippet List
ru: Восстановить исходный список сниппетов

source: Context Help
ru: Контекстная справка

source: Select a snippet category for display
ru: Выберите категорию сниппетов для отображения

source: Replace the current text by this snippet
ru: Заменить текущий текст этим сниппетом

source: Insert the snippet text at the current caret position replacing selected text if there is any
ru: Вставьте текст сниппета в текущую позицию курсора, если таковой есть

source: Copy the snippet text to the clipboard
ru: Копировать текст сниппета в буфер обмена

source: One topic back
ru: Одна тема возвращена

source: One topic forward
ru: Одна тема вперед

source: Toggle automatic context help
ru: Переключить автоматическую справку

source: Get context help for the item at the current caret position
ru: Получить помощь контекста для элемента в текущем положении курсора

source: Jump to
ru: Перейти к

source: Jump To
ru: Перейти к

source: Do you want to revert to the most recently saved version of '%s'? Any changes since them will be lost.
ru: Вы хотите вернуться к последней сохраненной версии '%s'? Все изменения будут потеряны.

source: Revert
ru: Восстановить

source: Opening SQL Editor
ru: Открытие SQL редактора

source: An SQL editor instance for '%s' is opening and should be available in a moment. Please stand by...
ru: экземпляр SQL редактора для '%s' открыт и должен быть доступен в данный момент. Пожалуйста, подождите...
