Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: Double click arrows in the list to choose whether to ignore changes, update the model with database changes or vice-versa. You can also apply an action to multiple selected rows.
ru: Дважды щелкните по стрелкам в списке, чтобы выбрать, игнорировать изменения, обновить модель с изменениями в базе данных или наоборот. Вы также можете применить действие к нескольким выбранным строкам.

source: Update Model
ru: Обновить модель

source: Update the model with changes detected in the target database/script.
ru: Обновление модели с изменениями, обнаруженными в целевой базе данных/скрипте.

source: Ignore the change and do not update neither the database/script nor the model.
ru: Игнорировать изменения и не обновлять ни базы данных/скриптов, ни модели.

source: Update Source
ru: Источник обновления

source: Update the database/script with changes detected in the source model.
ru: Обновите базу данных/скрипт с изменениями, обнаруженными в исходной модели.

source: Table Mapping...
ru: Сопоставление таблиц...

source: Fix table mapping, in case tables were renamed but are not being correctly recognized as such.
ru: Исправлено сопоставление таблиц, в случае переименования таблиц, но они не распознаются как таковые.

source: Column Mapping...
ru: Сопоставление столбцов...

source: Fix column mapping, in case columns were renamed but are not being correctly recognized as such.
ru: Исправлено сопоставление столбцов, в том случае, если столбцы были переименованы, но они не распознаны как таковые.

source: SQL Export Options
ru: Параметры экспорта SQL

source: Leave blank to view generated script but not save to a file.
ru: Оставьте пустым для просмотра сгенерированного скрипта, но не сохранять в файл.

source: Output SQL Script File:
ru: Вывод файла сценария SQL:

source: SQL Options
ru: Параметры SQL

source: Generate DROP Statements Before Each CREATE Statement
ru: Создать DROP операторы перед каждым оператором CREATE

source: Sort Tables Alphabetically
ru: Сортировать таблицы по алфавиту

source: Skip Creation of FOREIGN KEYS
ru: Пропустить создание НОВОГО КЛАВИША

source: Generate Separate CREATE INDEX Statements
ru: Создать отдельные операторы CREATE INDEX

source: Add SHOW WARNINGS After Every DDL Statement
ru: Добавить ПОКАЗАТЕЛЬНЫЕ ПРЕДУПРЕЖДЕНИЯ после каждого заявления DDL

source: Do Not Create Users. Only Export Privileges
ru: Не создавать пользователей. Экспортировать только привилегии

source: Don't create view placeholder tables.
ru: Не создавать шаблонные таблицы.

source: Generate INSERT Statements for Tables
ru: Создать INSERT операторы для таблиц

source: Disable FK checks for inserts
ru: Отключить проверку FK для вставки

source: Create triggers after inserts
ru: Создать триггеры после вставки

source: SQL Object Export Filter
ru: Фильтр экспорта объектов SQL

source: Filter Objects
ru: Фильтровать объекты

source: Review Generated Script
ru: Отзыв сгенерированный скрипт

source: Save to Other File...
ru: Сохранить в другой файл...

source: Review the generated script.
ru: Просмотреть сгенерированный скрипт.

source: Review and edit the generated script and press Finish to save.
ru: Просмотрите и отредактируйте сгенерированный скрипт и нажмите Finish для сохранения.

source: Could not generate CREATE script.
ru: Не удалось создать CREATE скрипт.

source: Error generating script.
ru: Ошибка генерации скрипта.

source: Wrote CREATE Script to '%s'
ru: Записать скрипт CREATE в '%s'

source: Forward Engineer SQL Script
ru: SQL скрипт форвардного инженера

source: Summary of Reverse Engineered Objects:
ru: Описание построенных объектов в обратном режиме:

source: - empty schema '%s'
ru: - пустая схема '%s'

source: %i tables
ru: %i таблиц

source: %s%i views
ru: %s%i просмотров

source: %s%i routines
ru: %s%i процедур

source: from schema '%s'
ru: из схемы '%s'

source: Select Objects to Reverse Engineer
ru: Выберите объекты для обратного инженера

source: The selected schemas contain no objects.
ru: Выбранные схемы не содержат объектов.

source: Place imported objects on a diagram
ru: Размещать импортированные объекты на диаграмме

source: Import %s Objects
ru: Импорт %s объектов

source: Resource Warning
ru: Предупреждение о ресурсах

source: Too many objects are selected for auto placement. Select fewer elements to create the EER diagram.
ru: Слишком много объектов выбрано для автоматического размещения. Выберите меньше элементов, чтобы создать EER диаграмму.

source: Reverse Engineering Progress
ru: Прогресс обратной инженерии

source: Reverse Engineer
ru: Реверсивный инженер

source: Reverse Engineer Selected Objects
ru: Обратный инженер выбранных объектов

source: Reverse engineering DDL from selected objects...
ru: Обратная инженерия DDL с выбранных объектов...

source: Place Objects on Diagram
ru: Разместить объекты на диаграмме

source: Placing objects...
ru: Размещение объектов...

source: Operation Completed Successfully
ru: Операция успешно завершена

source: Reverse Engineering Results
ru: Результаты реверсивной инженерии

source: Input and Options
ru: Вход и параметры

source: Select the script containing the schemas to reverse engineer
ru: Выберите скрипт, содержащий схемы для обратного инженера

source: Select SQL script file:
ru: Выберите файл сценария SQL:

source: File encoding:
ru: Кодировка файла:

source: Use ANSI quotes
ru: Использовать ANSI кавычки

source: Reverse Engineer SQL Script
ru: Обратный инженер SQL скрипт

source: Reverse engineering and importing objects from script...
ru: Реверсивная техника и импорт объектов из скрипта...

source: Verify Results
ru: Проверить результаты

source: Verifying imported objects...
ru: Проверка импортированных объектов...

source: Placing imported objects on a new diagram...
ru: Размещение импортированных объектов на новой диаграмме...

source: Import finished.
ru: Импорт завершён.

source: Import of SQL script file '%s' has finished. %i tables, %i views and %i stored procedures were imported in %i schemas.
ru: Импорт файла сценария SQL '%s' ' ' завершен. %i таблиц, %i просмотров и %i хранимых процедур были импортированы в схемах %i

source: There were errors during the import.
ru: Во время импорта были ошибки.

source: There were warnings during the import.
ru: Во время импорта были предупреждения.

source: Go Back to the previous page to review the logs.
ru: Вернитесь на предыдущую страницу, чтобы просмотреть журналы.

source: SQL Import Finished
ru: Импорт SQL завершён

source: SQL Import Finished Successfully
ru: SQL Импорт успешно завершен

source: SQL Import Failed
ru: Ошибка при импорте SQL

source: Select the Schemata to be Synchronized:
ru: Выберите схему для синхронизации:

source: Select Schemas
ru: Выберите схемы

source: Select the Schemas to be Synchronized
ru: Выберите схемы для синхронизации

source: schema not found in target
ru: схема не найдена в цели

source: The schemata from your model are missing from the target. If you are creating them for the first time use the Forward Engineer function.
ru: Схемы вашей модели отсутствуют в цели. Если вы создаете их впервые, используйте функцию форвардного инженера.

source: Reverse Engineer Database
ru: База данных обратного инженера

source: Reverse Engineer from SQL Script
ru: Обратный инженер из SQL скрипта

source: Apply Changes from DB to Model
ru: Применить изменения из БД к Модели

source: Apply SQL script to server
ru: Применить SQL скрипт к серверу

source: Fetching schema list.
ru: Загрузка списка схем.

source: Fetching schema list...
ru: Загрузка списка схемы...

source: Fetch finished.
ru: Загрузка завершена.

source: Internal error. Catalog is invalid
ru: Внутренняя ошибка. Каталог неверен

source: Executing SQL script in server
ru: Выполнение SQL-скрипта на сервере

source: The SQL script was successfully applied to server
ru: SQL скрипт был успешно применен к серверу

source: Error
ru: Ошибка

source: SQL Code:
ru: SQL код:

source: SQL script execution finished: statements:
ru: Выполнение SQL-скрипта завершено: операторы:

source: succeeded,
ru: успешно,

source: failed
ru: не удалось

source: Edit view `%s` of `%s`.`%s`
ru: Редактировать просмотр `%s`%s`.`%s`

source: Edit routine `%s` of `%s`.`%s`
ru: Редактировать рутин `%s` из `%s`.`%s`

source: Change Relationship Caption
ru: Изменить подпись отношения

source: Change Relationship 2nd Caption
ru: Изменить заголовок отношения 2-й подписи

source: Change Referred Mandatory
ru: Изменить обязательные рекомендации

source: Change Relationship Cardinality
ru: Изменить взаимосвязь кардинальность

source: Change Relationship Comment
ru: Изменить комментарий отношения

source: Change Relationship Visibility
ru: Изменить видимость отношения

source: Make Relationship Identifying (Set PK)
ru: Идентификация отношений (Set PK)

source: Change Generated Column Storage Type of '%s.%s' to %s
ru: Изменить тип хранилища созданного столбца '%s.%s' на %s

source: Change Generated Column Storage Type of '%s.%s'
ru: Изменение созданного столбца типа хранилища '%s.%s'

source: Set Generated Column Expression of '%s.%s'
ru: Набор генерированных столбцов выражение '%s.%s'

source: Set Default Value and Unset Auto Increment '%s.%s'
ru: Установить значение по умолчанию и отменить автоматическое увеличение '%s.%s'

source: Set Auto Increment '%s.%s'
ru: Установить автоматическое увеличение '%s.%s'

source: Unset Auto Increment '%s.%s'
ru: Отмена автоматического увеличения '%s.%s'

source: Set Generated Column '%s.%s'
ru: Набор генерируемого столбца '%s.%s'

source: Unset Generated Column '%s.%s'
ru: Не выбран столбец сгенерированный%s.%s'

source: Set Column Default
ru: Установить столбец по умолчанию

source: Name
ru: Наименование

source: Warning: the current server version does not allow multiple triggers for the same timing/event.
ru: Предупреждение: текущая версия сервера не позволяет несколько триггеров для одного и того же времени/события.

source: Select an existing trigger in the tree to edit it. Use the context menu to add and remove triggers.
ru: Выберите существующий триггер в дереве для его редактирования. Используйте контекстное меню для добавления и удаления триггеров.

source: Edit trigger `%s` of `%s`.`%s`
ru: Редактирование `%s` из `%s`.`%s`

source: Edit Stub Table
ru: Изменить таблицу Stub

source: The table you are trying to edit is a model-only stub, created to represent missing external tables referenced by foreign keys. Such tables are ignored by forward engineering and synchronization. You may convert this table to a real one that appears also in the generated SQL or keep it as stub.
ru: Таблица, которую вы пытаетесь изменить - это только укус модели, созданный для представления недостающих внешних таблиц на внешних ключах. Такие таблицы игнорируются форвардной инженерией и синхронизацией. Вы можете преобразовать эту таблицу в настоящую таблицу, которая также отображается в генерируемом SQL или хранить ее в упряжке.

source: Convert to real table
ru: Преобразовать в реальную таблицу

source: Edit as is
ru: Изменить как

source: Change '%s' for '%s'
ru: Изменить '%s' на '%s'

source: Change Partition Type for '%s'
ru: Изменить тип раздела для '%s'

source: Disable Partitioning for '%s'
ru: Отключить разметки для '%s'

source: Set Partition Expression for '%s'
ru: Установить выражение раздела для '%s'

source: Set Partition Count for '%s'
ru: Установить количество разделов для '%s'

source: Set Subpartition Type for '%s'
ru: Задать тип подраздела для '%s'

source: Set Subpartition Expression for '%s'
ru: Установить выражение подраздела для '%s'

source: Set Subpartition Count for '%s'
ru: Задать количество подразделов для '%s'

source: Manually Define Partitions for '%s'
ru: Определить разделы для '%s ' вручную

source: Implicitly Define Partitions for '%s'
ru: Определить разделы для '%s'

source: Manually Define SubPartitions for '%s'
ru: Вручную определить разделы для '%s'

source: Implicitly Define SubPartitions for '%s'
ru: Неопределенно определить разделы для '%s'

source: Change Partition Name for '%s'
ru: Изменить название раздела для '%s'

source: Change Partition Parameter for '%s'
ru: Изменить параметр раздела для '%s ' '

source: Change Partition Min Rows for '%s'
ru: Изменить разделы Мин. строки для '%s'

source: Change Partition Max Rows for '%s'
ru: Изменить размер разделов для '%s'

source: Change Partition Data Directory for '%s'
ru: Изменить каталог данных раздела для '%s ' '

source: Change Partition Index Directory for '%s'
ru: Изменить директорию индекса разделов для '%s'

source: Change Partition Comment for '%s'
ru: Изменить комментарий к разделу для '%s'

source: Change Storage Type of Index '%s.%s'
ru: Изменить тип хранилища индекса '%s.%s'

source: Change Key Block Size of Index '%s.%s'
ru: Изменить размер блока ключа индекса '%s.%s'

source: Change Parser of Index '%s.%s'
ru: Изменить парсер индекса%s.%s'

source: Set Visibility of Index '%s.%s'
ru: Установить видимость индекса '%s.%s'

source: Edit routine group `%s` of `%s`.`%s`
ru: Редактировать рутинную группу `%s` `%s`.`%s`

source: Update references to schema: `%s` -> `%s`
ru: Обновите ссылки на схему: `%s` -> `%s`

source: Role Hierarchy
ru: Роль иерархии

source: Privileges for Selected Object
ru: Привилегии для выбранного объекта

source: Objects
ru: Объекты

source: Differences Report
ru: Отчет о различиях

source: Differences Found in Catalog Comparison
ru: Различия найдены в каталоге сравнения

source: Compare and Report Differences in Catalogs
ru: Сравнить и отчетные различия в каталогах

source: Searching in server...
ru: Поиск в сервере...

source: Matches:
ru: Совпадения:

source: Copy Query
ru: Копировать запрос

source: Copy Query for Matches
ru: Копировать запрос для совпадений

source: Copy Keys
ru: Копировать ключи

source: Synchronization:
ru: Синхронизация:

source: Position to insert this in synchronization output scripts
ru: Позиция для вставки в выходные скрипты синхронизации

source: Forward Engineering:
ru: Инженерное движение:

source: Position to insert this in forward engineering output scripts
ru: Положение для вставки в форвардные инжиниринговые выходные скрипты

source: Change sync output position for %s
ru: Изменить позицию вывода синхронизации для %s

source: Change forward eng. output position for %s
ru: Изменить позицию пересылки. Вывод для %s

source: Duplicate note name.
ru: Повторяющееся имя заметки.

source: Change Note Text
ru: Изменить текст заметки

source: Change Note Name
ru: Изменить имя заметки

source: Change Layer Color
ru: Изменить цвет слоя

source: Change Layer Name
ru: Изменить имя слоя

source: Change Image
ru: Изменить изображение

source: Resize Image
ru: Изменить размер изображения

source: Set Image Size
ru: Размер изображения

source: Toggle Image Aspect Ratio
ru: Переключить пропорции изображения

source: Print Diagram
ru: Печать диаграммы

source: Print Preview
ru: Предпросмотр печати

source: Page Setup
ru: Настройка страницы

source: Edit Tag Categories
ru: Изменить категории тегов

source: Some of the categories could not be deleted because they are in use by tags.
ru: Некоторые категории не могут быть удалены, так как они используются метоками.

source: Add New Tag
ru: Добавить новый тег

source: Delete Tag %s
ru: Удалить тег %s

source: Edit Tag
ru: Изменить тег

source: Export Data to CSV File...
ru: Экспорт данных в CSV файл...

source: Import Data from CSV File...
ru: Импорт данных из CSV-файла...

source: Dump Data to SQL File...
ru: Сброс данных в SQL файл...

source: Name (short)
ru: Имя (короткое)

source: Name (long)
ru: Имя (длинное)

source: Select All Statement
ru: Выбрать все утверждения

source: Select Columns Statement
ru: Выберите Колонки

source: Insert Statement
ru: Добавить инструкцию

source: Update Statement
ru: Обновить отчёт

source: Delete Statement
ru: Удалить утверждение

source: Create Statement
ru: Создать утверждение

source: Procedure Call
ru: Вызов процедуры

source: Function Call
ru: Вызов функции

source: Join Selected Tables
ru: Присоединиться к выбранным таблицам

source: Delete with References
ru: Удалить со ссылками

source: Select Row References
ru: Выбрать ссылки на строку
