Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: The config file section is invalid.
ru: Секция конфигурационного файла неверна.

source: Specify Commands
ru: Укажите команды

source: Specify commands to be used to manage the MySQL server.
ru: Укажите команды для управления сервером MySQL.

source: The values on this page comprise rather low level commands, which are used to control the MySQL server instance (start or stop it) and others. If you are unsure what these values mean leave them untouched. The defaults are usually a good choice already (for single server machines).
ru: Значения на этой странице включают в себя довольно низкие команды, которые используются для управления экземпляром сервера MySQL (запуска или остановки) и другие. Если вы не уверены в том, что эти значения означают оставить их нетронутыми. Обычно это хороший выбор уже (для одиночных серверов).

source: Command to start the MySQL server:
ru: Команда запуска MySQL сервера:

source: Command to stop the MySQL server:
ru: Команда остановить сервер MySQL:

source: Check this box if you want or need the above commands to be executed with elevated Operating System Privileges.
ru: Установите этот флажок, если вы хотите или хотите выполнить вышеуказанные команды с повышенными привилегиями операционной системы.

source: Configure Local Management
ru: Настроить местное управление

source: Configure Remote Management
ru: Настройка удаленного управления

source: Breakpoints
ru: Точки останова

source: Hide
ru: Скрыть

source: Show
ru: Показать

source: Showing loaded schemas only
ru: Показывать только загруженные схемы

source: Search on Server...
ru: Поиск на сервере...

source: Schema
ru: Схема

source: Document Properties
ru: Свойства документа

source: Name:
ru: Имя:

source: Version:
ru: Версия:

source: Author:
ru: Автор:

source: Project:
ru: Проект:

source: Created:
ru: Создано:

source: Last Changed:
ru: Последнее изменение:

source: Description:
ru: Пояснение:

source: OK
ru: ОК

source: Configure Server Management...
ru: Настройка управления сервером...

source: Please enter a proper name for your new connection.
ru: Пожалуйста, введите правильное имя для вашего нового соединения.

source: Improper name
ru: Неправильное имя

source: A connection with the name %s exists already. Please choose another one.
ru: Соединение с именем %s уже существует. Пожалуйста, выберите другое.

source: Duplicate name
ru: Дублировать имя

source: New Script File
ru: Новый файл скрипта

source: Select the type of file to create
ru: Выберите тип файла для создания

source: Python Scripts that can be manually executed in the Scripting IDE or from the command line.
ru: Скрипты Python, которые могут быть выполнены вручную в IDE скриптов или из командной строки.

source: Plugins accessible by the user from various places in Workbench:
ru: Плагины, доступные пользователю из различных мест на рабочем столе:

source: Python modules containing functions exported to be used by other scripts, modules or plugins in Workbench.
ru: Модули Python, содержащие функции, экспортированные для использования другими скриптами, модулями или плагинами на Workbench.

source: Details
ru: Детали

source: Script File Name:
ru: Имя файла скрипта:

source: The default location for scripts is in the scripts folder of your Workbench configuration folder.
ru: Расположение по умолчанию для скриптов находится в папке сценариев в папке настроек рабочего стола.

source: Template:
ru: Шаблон:

source: Select the template for the type of plugin you want to write. A file may contain as many plugin functions as you want.
ru: Выберите шаблон для типа плагина, который вы хотите записать. Файл может содержать столько функций плагина, сколько хотите.

source: Plugin Name:
ru: Название плагина:

source: Provide a unique name for the plugin. Use alphanumeric characters and _ only.
ru: Укажите уникальное имя плагина. Используйте только буквенно-цифровые символы и _.

source: File Name:
ru: Имя файла:

source: Name of the plugin file, must be unique and contain only alphanumeric chars and _. Specify name only, without a path.
ru: Имя файла плагина должно быть уникальным и содержать только буквенно-цифровых символов и _. Укажите только имя без пути.

source: Module Name:
ru: Название модуля:

source: Provide a name for the module. Use alphanumeric characters and _ only.
ru: Укажите имя модуля. Используйте только буквенно-цифровые символы и _.

source: Function Name:
ru: Название функции:

source: Provide a name for the module function. Use alphanumeric characters and _ only.
ru: Укажите имя для функции модуля. Используйте только буквенно-цифровые символы и _.

source: Name of the module file, must be unique and contain only alphanumeric chars and _. Specify name only, without a path.
ru: Имя файла модуля, должно быть уникальным и содержать только буквенно-цифровых символов и _. Укажите имя только без пути.

source: Invalid Name
ru: Неверное имя

source: Please fill in a name for the script/module.
ru: Пожалуйста, заполните имя скрипта/модуля.

source: Please use only alpha-numeric characters and _ for the name.
ru: Пожалуйста, используйте только буквенно-цифровые символы и _ для названия.

source: Manage Server Connections
ru: Управление соединениями с сервером

source: Connection
ru: Подключение

source: Do not use remote management
ru: Не использовать удаленное управление

source: Hostname:
ru: Имя хоста:

source: Username:
ru: Имя пользователя:

source: Store in Vault ...
ru: Хранить в хранилище...

source: Store the password for this connection in the secured vault.
ru: Сохраните пароль для этого подключения в защищенном хранилище.

source: Remove from Vault
ru: Удалить из сейфа

source: Remove previously stored password from the secured vault.
ru: Удалите ранее сохраненный пароль из защищенного хранилища.

source: Store in Keychain ...
ru: Сохранить в Связке ключей...

source: Store the password for this connection in the system's keychain.
ru: Сохраните пароль для этого подключения в Связке ключей системы.

source: Remove from Keychain
ru: Удалить из связки ключей

source: Remove previously stored password from the system's keychain
ru: Удалить ранее сохраненный пароль из связки ключей системы

source: SSH Key Path:
ru: Путь к ключам SSH:

source: Path to the SSH private key to use for connecting to the remote SSH server. The key must be in the format used by OpenSSH. If you do not use OpenSSH to generate the key (ssh-keygen), you may need to convert your key to that format.
ru: Путь к закрытому ключу SSH для подключения к удаленному SSH серверу. Ключ должен быть в формате, используемом OpenSSH. Если вы не используете OpenSSH для генерации ключа (ssh-keygen), вам может потребоваться преобразовать ваш ключ в этот формат.

source: Browse
ru: Обзор

source: Detect Server Configuration...
ru: Обнаружение конфигурации сервера...

source: Attempt to automatically detect server configuration parameters for the system, such as operating system type, path to configuration file, how to start/stop MySQL etc
ru: Попытка автоматически определить параметры конфигурации сервера для системы, например тип операционной системы, путь к файлу конфигурации, как запускать/остановить MySQL и т. д.

source: Information about the server and MySQL configuration, such as path to the configuration file, command to start or stop it etc. You may pick a preset configuration profile or customize one for your needs.
ru: Информация о сервере и конфигурации MySQL, такие как путь к файлу конфигурации, команда запустить или остановить его и т.д. Вы можете выбрать предустановленный профиль конфигурации или настроить его для ваших нужд.

source: System Type:
ru: Тип системы:

source: Installation Type:
ru: Тип установки:

source: Configuration File:
ru: Файл конфигурации:

source: Configuration File Section:
ru: Секция файла конфигурации:

source: Windows Service Name:
ru: Имя службы Windows:

source: The following options specify how Workbench should perform certain management actions. Commands given here are the same as if they would be run in a system shell.
ru: Следующие варианты определяют как Workbench должен выполнять определенные управленческие действия. Указанные здесь команды такие же, как если бы они выполнялись в системной оболочке.

source: MySQL Management
ru: Управление MySQL

source: Elevate privileges to execute start/stop commands and write configuration data
ru: Повысить привилегии для выполнения команд запуска/остановки и записать данные конфигурации

source: Acquire administrator rights to execute start/stop commands and write configuration data
ru: Получать права администратора для выполнения команд запуска/остановки и записи данных конфигурации

source: When sudo is used in Linux like systems, a certain set of parameters are passed to it. In certain environments, it may be necessary to override these parameters. Look at the Workbench log file to determine the parameters being currently used. Leave it blank if unsure.
ru: Когда sudo используется в Linux, как системы, передается определенный набор параметров. В некоторых окружениях может потребоваться переопределить эти параметры. Посмотрите на файл журнала Workbench для определения параметров, которые в настоящее время используются. Оставьте пустым, если не уверены.

source: Override sudo command line:
ru: Переопределить командную строку sudo:

source: Store Password For Server
ru: Пароль магазина для сервера

source: Custom
ru: Свой

source: Remote Management
ru: Удаленное управление

source: System Profile
ru: Профиль системы

source: Pick SSH Private Key
ru: Выбрать SSH приватный ключ

source: User Defined Types
ru: Определенные пользователем типы

source: Type
ru: Тип

source: Definition
ru: Определение

source: Flags
ru: Флаги

source: Type:
ru: 4.3.2 Тип:

source: Arguments:
ru: Аргументы:

source: Edit value list as string list.
ru: Редактировать список значений в виде списка строк.

source: Flags:
ru: Флаги:

source: Delete User Type
ru: Удалить тип пользователя

source: Type '%s' is used in a column and cannot be deleted.
ru: Тип '%s' используется в столбце и не может быть удален.

source: Invalid Type Name
ru: Неверное имя типа

source: '%s' is not a valid type name. Names may only contain alpha-numeric characters, spaces and _
ru: '%s' не является допустимым именем типа. Имена могут содержать только алфавитно-цифровые символы, пробелы и _

source: Duplicate Type Name
ru: Дублировать имя типа

source: There are two or more types with the same name '%s'.
ru: Существует два или более типа с одинаковым именем '%s'.

source: Edit User Defined Types
ru: Редактировать определенные пользователем типы

source: Edit Type Arguments
ru: Редактировать аргументы типа

source: Specify default target MySQL version in format MAJOR.MINOR or MAJOR.MINOR.RELEASE
ru: Укажите целевую версию MySQL по умолчанию в формате MAJOR.MINOR или MAJOR.MINOR.RELEASE

source: This is not valid version of MySQL. Specify default target MySQL version in format MAJOR.MINOR or MAJOR.MINOR.RELEASE
ru: Некорректная версия MySQL. Укажите целевую версию MySQL по умолчанию в формате MAJOR.MINOR или MAJOR.MINOR.RELEASE

source: Workbench Preferences
ru: Настройки рабочего стола

source: Model Options
ru: Параметры модели

source: Use defaults from global settings
ru: Использовать по умолчанию из глобальных настроек

source: General Editors
ru: Общие редакторы

source: SQL Editor
ru: Редактор SQL

source: Query Editor
ru: Редактор запросов

source: Object Editors
ru: Редактор объектов

source: SQL Execution
ru: Выполнение SQL

source: Defaults
ru: По умолчанию

source: Diagram
ru: Диаграмма

source: Appearance
ru: Внешний вид

source: Fonts & Colors
ru: Шрифты и цвета

source: Fonts
ru: Шрифты

source: Others
ru: Другие

source: Change Options
ru: Изменить параметры

source: Data Export and Import
ru: Экспорт и импорт данных

source: Path to mysqldump Tool:
ru: Путь к инструменту mysqldump:

source: Specifiy the full path to the mysqldump tool, which is needed for the Workbench Administrator. It usually comes bundled with the MySQL server and/or client packages.
ru: Укажите полный путь к инструменту mysqldump, который необходим администратору Workbench. Обычно он поставляется в комплекте с сервером MySQL и/или клиентскими пакетами.

source: Leave blank to use bundled version.
ru: Оставьте пустым для использования комплектной версии.

source: Full path to the mysqldump tool if it's not in your PATH.
ru: Полный путь к инструменту mysqldump , если он не в вашем PATH.

source: Path to mysql Tool:
ru: Путь к инструменту mysql:

source: Specifiy the full path to the mysql command line client tool, which is needed for the Workbench Administrator. It usually comes bundled with the MySQL server and/or client packages.
ru: Укажите полный путь к клиентскому инструменту mysql, который необходим администратору Workbench. Обычно он поставляется в комплекте с сервером MySQL и/или клиентскими пакетами.

source: Full path to the mysql tool if it's not in your PATH.
ru: Полный путь к инструменту mysql , если он не в вашем PATH.

source: Export Directory Path:
ru: Путь к каталогу экспорта:

source: Specifiy the full path to the directory where dump files should be placed by default.
ru: Укажите полный путь к каталогу, где дамп файлы должны быть размещены по умолчанию.

source: Location where dump files should be placed by default.
ru: Место, где дамп файлы должны быть размещены по умолчанию.

source: Save snapshot of open editors on close
ru: Сохранить снимок открытых редакторов при закрытии

source: A snapshot of all open scripts is saved when the SQL Editor is closed. Next time it is opened to the same connection that state is restored. Unsaved files will remain unsaved, but their contents will be preserved.
ru: При закрытии SQL редактора сохраняется снимок всех открытых скриптов. В следующий раз он будет открыт к тому же соединению, что и состояние восстановлено. Несохраненные файлы останутся несохраненными, но их содержимое будет сохранено.

source: Auto-save scripts interval:
ru: Интервал автосохранения скриптов:

source: Interval to perform auto-saving of all open script tabs. The scripts will be restored from the last auto-saved version if Workbench unexpectedly quits.
ru: Интервал для автоматического сохранения всех вкладок открытых скриптов. Скрипты будут восстановлены из последней автоматически сохраненной версии, если Workbench неожиданно завершился.

source: Create new tabs as Query tabs instead of File
ru: Создать новые вкладки как Запрашивать вкладки вместо файла

source: Unsaved Query tabs do not get a close confirmation, unlike File tabs. However, once saved, such tabs will also get unsaved change confirmations. If Snapshot saving is enabled, query tabs are always autosaved to temporary files when the connection is closed.
ru: Несохраненные вкладки запроса не подтверждают закрытые вкладки, в отличие от вкладок Файла. Однако, после сохранения, такие вкладки также получат несохраненные подтверждения изменений. Если Snapshot'ы включены, вкладки запросов всегда автоматически сохраняются во временных файлах при закрытии соединения.

source: Restore expanded state of the active schema objects
ru: Восстановить расширенное состояние активных объектов схемы

source: Re-expand (and reload) group nodes that were previously expanded in the active schema when the editor was last closed.
ru: Переразвернуть (и перезагрузить) узлы группы, которые ранее были расширены в активной схеме, когда редактор был последний раз закрыт.

source: Side Bar
ru: Боковая панель

source: Show Schema Contents in Schema Tree
ru: Показывать содержимое схемы в дереве схемы

source: Whether to show schema contents (tables, views and routine names) in schema tree.
ru: Показывать содержимое схемы (таблицы, представления и обычные имена) в дереве схемы.

source: Show Metadata and Internal Schemas
ru: Показать метаданные и внутренние схемы

source: Whether to show internal schemas in the schema tree (eg INFORMATION_SCHEMA, mysql and schemas starting with '.').
ru: Показывать ли внутренние схемы в дереве схемы (например, INFORMATION_SCHEMA, mysql и схем, начиная с '.').

source: MySQL Session
ru: Сеанс MySQL

source: DBMS connection keep-alive interval (in seconds):
ru: Хранитель-живой интервал подключения СУБД (в секундах):

source: Time interval between sending keep-alive messages to DBMS. Set to 0 to not send keep-alive messages.
ru: Интервал времени между отправкой keep-alive сообщений в DBMS. Установите в 0, чтобы не отправлять keep-alive сообщения.

source: DBMS connection read timeout interval (in seconds):
ru: Тайм-аут соединения СУБД (в секундах):

source: The maximum amount of time the query can take to return data from the DBMS.Set 0 to skip the read timeout.
ru: Максимальное время ожидания запроса для возврата данных из DBMS.Set 0, чтобы пропустить ожидаемый тайм-аут.

source: DBMS connection timeout interval (in seconds):
ru: Тайм-аут подключения СУБД (в секундах):

source: Maximum time to wait before a connection attempt is aborted.
ru: Максимальное время ожидания перед прекращением попытки подключения.

source: Other
ru: Прочие вопросы

source: Internal Workbench Schema:
ru: Внутренняя схема рабочего стола:

source: This schema will be used by MySQL Workbench to store information required for certain operations.
ru: Эта схема будет использоваться MySQL Workbench для хранения информации, необходимой для определенных операций.

source: Safe Updates (rejects UPDATEs and DELETEs with no restrictions)
ru: Безопасные обновления (отменяет UPDATE и DELETE, без ограничений)

source: Enables the SQL_SAFE_UPDATES option for the session. If enabled, MySQL aborts UPDATE or DELETE statements that do not use a key in the WHERE clause or a LIMIT clause. This makes it possible to catch UPDATE or DELETE statements where keys are not used properly and that would probably change or delete a large number of rows. Changing this option requires a reconnection (Query -> Reconnect to Server)
ru: Включить параметр SQL_SAFE_UPDATES для сессии. Если включено, MySQL прерывает UPDATE или DELETE операторы, которые не используют ключ в клаузуле WHERE или LIMIT оговорке. Это позволяет перехватывать UPDATE или DELETE операторы, где ключи используются неправильно и что, вероятно, изменит или удалит большое количество строк. Изменение этой опции требует переподключения (Запрос -> Переподключиться к серверу)

source: SQL Parsing in Code Editors
ru: Анализ SQL в редакторах кода

source: Default SQL_MODE for syntax checker:
ru: SQL_MODE по умолчанию для проверки синтаксиса:

source: Value of SQL_MODE DBMS session variable customizes the rules and restrictions for SQL syntax and semantics. See MySQL Server reference for details. This globally defined parameter determines initial value for same named parameter in each newly created model. Model scoped same named parameter in its turn affects SQL parsing within the model, and defines the value of SQL_MODE session variable when connecting to DBMS. Note: Empty value for this parameter will cause Workbench to treat SQL_MODE as empty string when parsing SQL within the model, but will leave DBMS session variable at its default value. To force Workbench to reset SQL_MODE session variable as well, this parameter needs to be set to a whitespace symbol.
ru: Значение сессионной переменной SQL_MODE DBMS настраивает правила и ограничения для синтаксиса и семантики SQL. Подробнее см. в разделе MySQL Server . Этот глобально определенный параметр определяет начальное значение одного и того же именованного параметра в каждой недавно созданной модели. Модель охвачена тем же именованным параметром в свою очередь, влияет на парсинг SQL внутри модели, и определяет значение переменной сессии SQL_MODE при подключении к DBMS. Примечание: Пустое значение для этого параметра приведет к тому, что Workbench будет рассматривать SQL_MODE как пустую строку при анализе SQL внутри модели, , но будет оставлять сессионную переменную DBMS в значение по умолчанию. Чтобы заставить Workbench сбросить переменную сессии SQL_MODE этот параметр должен быть установлен как символ пробела.

source: SQL Identifiers are Case Sensitive
ru: SQL идентификаторы чувствительны к регистру

source: Whether to treat identifiers separately if their names differ only in letter case.
ru: Должно ли относиться к идентификаторам отдельно, если их имена отличаются только буквенным случаем.

source: Delimiter used for statements that use the semicolon as part of their syntax (e.g. stored routines)
ru: Разделитель, используемый для выражений, использующих точку с запятой как часть синтаксиса (например, сохраненные процедуры)

source: Indentation
ru: Отступ

source: Tab key inserts spaces instead of tabs
ru: Клавиша вкладки вставляет пробелы вместо вкладок

source: Productivity
ru: Производительность

source: Enable Code Completion in Editors
ru: Включить завершение кода в редакторах

source: If enabled SQL editors display a code completion list when pressing the defined hotkey
ru: Если включено, то редакторы SQL будут отображать список дополнения кода при нажатии определенной горячей клавиши

source: Automatically Start Code Completion
ru: Автоматически завершать код

source: Available only if code completion is enabled. By activating this option code completion will be started automatically when you type something and wait a moment
ru: Доступно только если включено завершение кода. После активации этого кода опции будет запущено автоматически, когда вы вводите что-то и подождите

source: Use UPPERCASE keywords on completion
ru: Использовать UPPERCASE ключевые слова при завершении

source: Normally keywords are shown and inserted as they come from the code editor configuration file. With this swich they are always upper-cased instead.
ru: Обычно ключевые слова отображаются и вставляются по мере их появления из файла конфигурации редактора кода. При этом они всегда воспроизводятся в верхнем регистре.

source: Comment type to use for comment shortcut:
ru: Тип комментария, используемый для ярлыка комментариев:

source: Default comment type for SQL Query editor, to be used when the comment shortcut is used.
ru: Тип комментария по умолчанию для SQL Query редактора, который будет использоваться при использовании ярлыка комментария.

source: Max syntax error count:
ru: Макс. количество ошибок синтаксиса:

source: Maximum number of errors for syntax checking. Syntax errors aren't highlighted beyond this threshold. Set to 0 to show all errors.
ru: Максимальное количество ошибок для проверки синтаксиса. Синтаксические ошибки не подсвечиваются вне этого порога. Установите значение 0, чтобы показать все ошибки.

source: Max number of result sets:
ru: Максимальное количество результирующих наборов:

source: Maximum number of result sets that can be opened for a single editor.
ru: Максимальное количество результирующих наборов, которые могут быть открыты для одного редактора.

source: Change keywords to UPPER CASE
ru: Изменить ключевые слова на UPPER CASE

source: Default algorithm for ALTER table:
ru: Алгоритм по умолчанию для таблицы ALTER:

source: Default lock for ALTER table:
ru: Блокировка ALTER по умолчанию:

source: Reformat DDL for Views
ru: Переформатировать DDL для просмотра

source: Whether to automatically reformat View DDL returned by the server. The MySQL server does not store the formatting information for View definitions.
ru: Должен ли автоматически переформатировать View DDL возвращается сервером. Сервер MySQL не хранит информацию о форматировании для просмотра определений.

source: General
ru: Общие положения

source: Max. query length to store in history (in bytes):
ru: Макс. длина запроса для хранения в истории (в байтах):
