Repository: maximloginov/mysql-workbench
Catalog: po/*.po
Languages: ru

source: An error occurred during auto-save: %s
ru: Произошла ошибка при автосохранении: %s

source: Error on Auto Save
ru: Ошибка при автосохранении

source: Skip Auto Saving
ru: Пропустить автосохранение

source: Restored last session state
ru: Восстановлено последнее состояние сеанса

source: Added new script editor
ru: Добавлен новый редактор скриптов

source: Added new scratch query editor
ru: Добавлен новый редактор запросов scratch

source: Opening %s...
ru: Открытие %s...

source: Open SQL Script
ru: Открыть сценарий SQL

source: Cancelled open file
ru: Открытый файл отменен

source: Open File
ru: Открыть файл

source: SQL script %s has unsaved changes. Would you like to Save these changes?
ru: SQL-скрипт %s имеет несохраненные изменения. Вы хотите сохранить эти изменения?

source: Could not open file %s %s
ru: Не удалось открыть файл %s %s

source: Create New Schema
ru: Создать новую схему

source: Schema '%s' created.
ru: Схема '%s' создана.

source: Delete Schema
ru: Удалить схему

source: Deleting schema...
ru: Удаление схемы...

source: The schema '%s' contains objects (%s). Do you want to delete it with all its contents?
ru: Схема '%s' содержит объекты (%s). Вы хотите удалить её со всем содержимым?

source: Delete schema cancelled.
ru: Удаление схемы отменено.

source: Schema deleted.
ru: Схема удалена.

source: Could not delete schema.
ru: Не удалось удалить схему.

source: Create Table
ru: Создать таблицу

source: Table '%s' created in schema '%s'
ru: Таблица '%s' создана в схеме '%s'

source: Could not create new table.
ru: Не удалось создать новую таблицу.

source: Create View
ru: Создать представление

source: View '%s' created in schema '%s'
ru: Просмотр '%s' созданного в схеме '%s'

source: Could not create new view
ru: Не удалось создать новый вид

source: Create Routine Group
ru: Создать рутинную группу

source: Routine group '%s' created in schema '%s'
ru: Группа рутинных '%s' создана в схеме '%s'

source: Could not create new routine group
ru: Не удалось создать новую группу шаблонов

source: Create Routine
ru: Создать шаблон

source: Routine '%s' created in schema '%s'
ru: Процедура '%s' ' создана в схеме '%s'

source: Could not create new routine
ru: Не удалось создать новую процедуру

source: Add Script File '%s'
ru: Добавить файл скрипта '%s'

source: New Note
ru: Новая заметка

source: Add Text Note
ru: Добавить заметку

source: Add Note File '%s'
ru: Добавить файл заметки '%s'

source: Place '%s'
ru: Поставить '%s'

source: Cannot place object.
ru: Невозможно поместить объект.

source: Place Object on Canvas
ru: Поместить объект на холст

source: Placed %s
ru: Размещено %s

source: Failed placing db object.
ru: Не удалось разместить объект db.

source: Cannot Place Object
ru: Невозможно разместить объект

source: The object cannot be placed in the diagram.
ru: Объект не может быть размещен на диаграмме.

source: Place Object in Diagram
ru: Разместить объект в диаграмме

source: '%s' is already in this diagram. Would you like to duplicate the schema object and place a copy?
ru: '%s' уже находится на этой диаграмме. Хотите дублировать объект схемы и разместить копию?

source: Place object(s) on canvas
ru: Разместить объект(ы) на холсте

source: Create n:m Relationship
ru: Создать связь n:m

source: Delete Table
ru: Удалить таблицу

source: Delete View
ru: Удалить вид

source: Delete Routines
ru: Удалить процедуры

source: Would you like to delete the routines contained in group '%s'?
ru: Вы хотите удалить процедуры, содержащиеся в группе '%s'?

source: Keep
ru: Оставить

source: There are %lu routines in '%s' that are not in any other group, would you like to delete them?
ru: Есть %lu процедур в '%s', которые не являются ни в одной другой группе, хотите удалить их?

source: Delete Routine Group
ru: Удалить рутинную группу

source: Delete Routine
ru: Удалить шаблон

source: Delete Foreign Key Columns
ru: Удалить колонки внешнего ключа

source: Please confirm whether columns used by the foreign key should be deleted too. Columns used by other foreign keys will be left untouched.
ru: Пожалуйста, подтвердите, следует ли также удалить столбцы, используемые внешним ключом. Столбцы, используемые другими внешними ключами, останутся нетронутыми.

source: Delete Relationship
ru: Удалить связь

source: Remove Figure '%s'
ru: Удалить фигуру '%s'

source: Delete '%s'
ru: Удалить '%s'

source: Error undoing file delete: can't read contents of temporary file '%s'
ru: Ошибка при отмене удаления файла: невозможно прочитать содержимое временного файла '%s'

source: Error adding file: can't read contents of file '%s': %s
ru: Ошибка при добавлении файла: невозможно прочитать содержимое файла '%s': %s

source: Could not save temporary file '%s'
ru: Не удалось сохранить временный файл '%s'

source: Create Relationship
ru: Создать связь

source: Update Relationship
ru: Обновить отношения

source: Remove Relationship
ru: Удалить связь

source: Select location for new table.
ru: Выберите местоположение для новой таблицы.

source: Select location for new view.
ru: Выберите местоположение для нового представления.

source: Select location for new routine group.
ru: Выберите местоположение для новой группы меток.

source: Create User '%s'
ru: Создать пользователя '%s'

source: User '%s' created
ru: Пользователь '%s' создан

source: Remove User '%s'
ru: Удалить пользователя '%s'

source: Removed user '%s'
ru: Удален пользователь '%s'

source: Create Role '%s'
ru: Создать роль '%s ' '

source: Role '%s' created
ru: Роль '%s' создана

source: Remove Role '%s'
ru: Удалить роль '%s ' '

source: Removed role '%s'
ru: Удалена роль '%s'

source: Remove Object Privileges
ru: Удалить привилегии объекта

source: Remove Tags for Object
ru: Удалить теги для объекта

source: Select the Table to receive the Foreign Key or the Column(s) to turn into a Foreign Key.
ru: Выберите таблицу для получения внешнего ключа или столбца(ов) для превращения в внешний ключ.

source: Select the first Table to be joined.
ru: Выберите первую таблицу для присоединения.

source: Select the Table to receive the Foreign Key.
ru: Выберите таблицу для получения внешнего ключа.

source: '%s' has no Primary Key. Please add a PK or select another Table.
ru: '%s' не имеет первичного ключа. Пожалуйста, добавьте PK или выберите другую таблицу.

source: '%s' selected. Please select the second Table.
ru: '%s' выбрано. Пожалуйста, выберите вторую таблицу.

source: '%s' selected. Please select the Referenced Table.
ru: '%s' выбрано. Пожалуйста, выберите ссылку на таблицу.

source: Foreign Key columns must belong to the same table.
ru: Столбцы внешнего ключа должны принадлежать к той же таблице.

source: Column has already been picked, please pick another or pick the referenced table.
ru: Столбец уже выбран или выберите другую таблицу.

source: Column '%s' selected.
ru: Столбец '%s' выбран.

source: Pick other columns that belong to the Foreign Key or proceed to pick the referenced table or matching columns in it.
ru: Выберите другие столбцы, принадлежащие к внешнему ключу или выберите приведенную в нем таблицу или соответствующие колонки.

source: Referenced columns must belong to the same table.
ru: Ссылаемые столбцы должны принадлежать к той же таблице.

source: Invalid column, please pick an appropriate column with matching type.
ru: Недопустимый столбец, выберите соответствующий столбец с соответствующим типом.

source: Please pick the referenced column.
ru: Пожалуйста, выберите приведенный столбец.

source: Relationship between '%s' and '%s' created through an associative table.
ru: Отношение между '%s' и ' '%s' создано через ассоциативную таблицу.

source: Cannot create relationship between '%s' and '%s'.
ru: Невозможно создать связь между '%s' и '%s'.

source: Relationship between '%s' and '%s' created.
ru: Отношение между '%s' и '%s' создано.

source: Please select the table to receive the Foreign Key.
ru: Пожалуйста, выберите таблицу для получения внешнего ключа.

source: Please select the referenced table.
ru: Пожалуйста, выберите приведенную таблицу.

source: Please pick referenced columns or table.
ru: Пожалуйста, выберите ссылающиеся столбцы или таблицу.

source: Paste '%s'
ru: Вставить '%s'

source: Schema Privileges
ru: Привилегии схемы

source: Add User
ru: Добавить пользователя

source: Add Role
ru: Добавить роль

source: Rename Diagram to '%s'
ru: Переименовать диаграмму в '%s'

source: EER Diagrams
ru: Схемы ЭВС

source: Foreign Key Columns
ru: Столбцы внешнего ключа

source: Pick one or more columns for the foreign key.
ru: Выберите один или несколько столбцов для внешнего ключа.

source: Pick Referenced Columns
ru: Выбрать столбцы со ссылками

source: Referenced Columns
ru: Колонки со ссылками

source: Pick matching columns for the referenced table.
ru: Выберите подходящие столбцы для справочной таблицы.

source: Drag the canvas to move it around.
ru: Перетащите холст, чтобы переместить его.

source: Click the object to delete.
ru: Нажмите на объект для удаления.

source: Select an area for the new layer.
ru: Выберите область для нового слоя.

source: Select an area for a text object.
ru: Выберите область для текстового объекта.

source: Select a location for the image object.
ru: Выберите местоположение для объекта изображения.

source: Left-click anywhere on the diagram to zoom in.
ru: Щелкните левой кнопкой мыши в любом месте на диаграмме для увеличения.

source: Left-click anywhere on the diagram to zoom out.
ru: Чтобы уменьшить масштаб нажмите левой кнопкой мыши в любом месте на диаграмме.

source: New Layer
ru: Новый слой

source: Place New Layer
ru: Поместить новый слой

source: Created new layer.
ru: Создан новый слой.

source: Place new layer
ru: Поместить новый слой

source: Delete '%s' Figure
ru: Удалить '%s' фигуру

source: Delete '%s' Layer
ru: Удалить слой '%s'

source: Removed %s
ru: Удалено %s

source: Please select a larger area.
ru: Пожалуйста, выберите большую область.

source: Place Image
ru: Поместить изображение

source: Cannot Open Image File
ru: Не удается открыть файл изображения

source: Images must be in PNG format.
ru: Изображения должны быть в формате PNG.

source: Engine
ru: Двигатель

source: Created
ru: Создано

source: Modified
ru: Изменено

source: Comment
ru: Комментарий

source: Add Table
ru: Добавить таблицу

source: Add View
ru: Добавить вид

source: Add Routine
ru: Добавить шаблон

source: Add Group
ru: Добавить группу

source: Place Figure
ru: Поместить фигуру

source: Set Diagram Properties
ru: Установить свойства диаграммы

source: Templates
ru: Шаблоны

source: Could not store document data to autosave file.
ru: Не удалось сохранить данные документа в файл автосохранения.

source: Duplicate Table '%s'
ru: Дублировать таблицу '%s'

source: Duplicate View '%s'
ru: Повторяющийся вид '%s'

source: Duplicate Routine Group '%s'
ru: Дублировать рутинную группу '%s'

source: Copy %s
ru: Копировать %s

source: Remove Figure %s
ru: Удалить фигуру %s

source: Edit in New Tab...
ru: Изменить в новой вкладке...

source: Edit %s...
ru: Изменить %s...

source: Edit %s in New Tab...
ru: Редактировать %s в новой вкладке...

source: Undo %s
ru: Отменить %s

source: Redo %s
ru: Повторить %s

source: Exporting to %s...
ru: Экспорт в %s...

source: Exported diagram image to %s
ru: Экспортировано изображение диаграммы в %s

source: Could not export to PNG file.
ru: Не удалось экспортировать в PNG файл.

source: Export to PNG
ru: Экспорт в PNG

source: Cannot Export Diagram
ru: Невозможно экспортировать диаграмму

source: Current diagram cannot be exported as image, please select a diagram first.
ru: Текущая диаграмма не может быть экспортирована как изображение, сначала выберите диаграмму.

source: Exporting full model diagram to %s...
ru: Экспорт полной диаграммы модели в %s...

source: Exported PDF to %s
ru: Экспортировано PDF в %s

source: Could not export to PDF
ru: Не удалось экспортировать в PDF

source: Export to PDF
ru: Экспорт в PDF

source: Exported SVG to %s
ru: Экспортировано SVG в %s

source: Could not export to SVG
ru: Не удалось экспортировать в SVG

source: Export to SVG
ru: Экспорт в SVG

source: Exported PS to %s
ru: Экспорт PS в %s

source: Could not export to PS file
ru: Не удалось экспортировать в файл PS

source: Export to PS File
ru: Экспорт в файл PS

source: Creating Diagram...
ru: Создание диаграммы...

source: Diagram added.
ru: Диаграмма добавлена.

source: Delete Diagram '%s'
ru: Удалить диаграмму '%s'

source: Move %s
ru: Переместить %s

source: Move Objects
ru: Переместить объекты

source: %i Selected Figures
ru: %i выбранных фигур

source: %i figure(s) cut.
ru: %i фигура(ов).

source: Pasting figures...
ru: Вставка фигур...

source: %i figure(s) pasted.
ru: %i фигур(ов) вставлено.

source: %i figure(s) pasted, %i duplicated.
ru: %i цифр(ов) вставлено, %i дублировано.

source: Remove %s
ru: Удалить %s

source: %i figure(s) removed. The corresponding DB objects were kept.
ru: %i фигур(ов) удалено. Объекты БД сохранены.

source: Found %s '%s'
ru: Найдено %s '%s'

source: No more matches
ru: Больше ничего не найдено

source: No match found
ru: Совпадений не найдено

source: Routine Groups
ru: Группы рутин

source: Edit Schema...
ru: Изменить схему...

source: Edit Table...
ru: Изменить таблицу...

source: Edit View...
ru: Изменить вид...

source: Edit Routine...
ru: Изменить процедуру...

source: Edit Routine Group...
ru: Изменить рутинную группу...

source: Physical Schemas
ru: Физические схемы

source: Duplicate object name.
ru: Дублировать имя объекта.

source: Rename '%s' to '%s'
ru: Переименовать '%s' в '%s'

source: SQL Scripts
ru: SQL скрипты

source: Add Script File...
ru: Добавить файл скрипта...

source: Model Notes
ru: Заметки модели

source: Add Note File...
ru: Добавить файл заметок...

source: Add Note
ru: Добавить заметку

source: %s Model%s
ru: %s Модель%s

source: MySQL Model
ru: Модель MySQL

source: New Diagram '%s'
ru: Новая схема '%s'

source: Set Primary Key
ru: Установить основной ключ

source: Remove Column '%s.%s'
ru: Удалить столбец '%s.%s'

source: Remove Foreign Key
ru: Удалить внешний ключ

source: Unset Primary Key
ru: Сбросить первичный ключ

source: Change Column Type
ru: Изменить тип столбца

source: Add New Routine Object
ru: Добавить объект Routine

source: Add New Routine Group Object
ru: Добавить новый объект Routine группы

source: Add New Table Object
ru: Добавить объект таблицы

source: Add New View Object
ru: Добавить новый вид объекта

source: Clear Referencing Foreign Key %s.%s
ru: Очистить ссылку на внешний ключ %s.%s

source: Delete Table '%s'
ru: Удалить таблицу '%s'

source: Set Password for User '%s'
ru: Установить пароль для пользователя '%s'

source: Assign Role '%s' to User '%s'
ru: Назначить роль '%s' пользователю '%s'

source: Revoke Role '%s' from User '%s'
ru: Отозвать роль '%s' ' у пользователя '%s'

source: Rename Role to '%s'
ru: Переименовать роль в '%s'

source: Change Charset/Collation for '%s'
ru: Изменить Charset/Collation для '%s'

source: Set Default Character Set for Schema '%s'
ru: Установить набор символов по умолчанию для схемы '%s'

source: Set Default Collation for Schema '%s'
ru: Установить стандартную комбинацию для схемы '%s'

source: Object %s was changed
ru: Объект %s был изменен

source: Do you want to save changes made to %s?
ru: Вы хотите сохранить изменения, внесенные в %s?

source: Rename to '%s'
ru: Переименовать в '%s'

source: Edit Comment
ru: Изменить комментарий

source: Comment Out SQL
ru: Прокомментировать SQL

source: Reorder Column '%s.%s'
ru: Столбец перезаказа '%s.%s'

source: Reorder Columns in '%s'
ru: Сортировать столбцы в '%s'

source: Add Column to '%s'
ru: Добавить столбец в '%s'

source: Add Unique Index for '%s'.'%s'
ru: Добавить уникальный индекс для '%s'.'%s'

source: Remove Unique Index for '%s'.'%s'
ru: Удалить Уникальный индекс для '%s'.'%s'

source: Add column '%s.%s'
ru: Добавить столбец '%s.%s'

source: Set Type of '%s.%s'
ru: Установить тип '%s.%s'

source: Set Default Value of '%s.%s'
ru: Установить значение по умолчанию для '%s.%s'

source: Set Collation/Charset of '%s.%s'
ru: Установить Коллекцию/Кодировщик '%s.%s'

source: Set Character Set of '%s.%s'
ru: Установить набор символов из '%s.%s'

source: Set Collation of '%s.%s'
ru: Установить сравнение '%s.%s'

source: Set Comment of '%s.%s'
ru: Установить комментарий для '%s.%s'

source: Set '%s.%s' PK
ru: Установить '%s.%s' PK

source: Set '%s.%s' NOT NULL
ru: Установить '%s.%s' НЕ НЕЛЬКО

source: Unset %s of '%s.%s'
ru: Сброс %s из '%s.%s'

source: Set %s of '%s.%s'
ru: Установить %s из '%s.%s'

source: Clear Column Default
ru: Очистить столбец по умолчанию

source: Set Column Default to NULL
ru: Установить столбец по умолчанию на NULL

source: Set Storage Order of Index Column '%s.%s.%s'
ru: Установите порядок хранения индекса столбца '%s.%s.%s'

source: Set Length of Index Column '%s.%s.%s'
ru: Установите длину индекса столбца '%s.%s.%s'

source: Reorder for Index Column '%s.%s.%s'
ru: Переупорядочить колонку индекса '%s.%s.%s'

source: Delete Selected
ru: Удалить выбранные

source: Add column '%s' to primary key from '%s'
ru: Добавить столбец '%s' ' к первичному ключу из '%s'

source: Add column '%s' to index '%s.%s'
ru: Добавить столбец '%s' ' ' '%s.%s'

source: Remove column '%s' from primary key from '%s'
ru: Удалить столбец '%s' ' из первичного ключа '%s'

source: Remove column '%s' from index '%s.%s'
ru: Удалить столбец '%s' ' из индекса '%s.%s'

source: Rename Index '%s.%s'
ru: Переименовать индекс '%s.%s'

source: Set Type of Index '%s.%s'
ru: Установить тип индекса '%s' .%s'

source: Set Comment of Index '%s.%s'
ru: Установить комментарий к индексу%s.%s'

source: Set Ref. Column for FK '%s.%s'
ru: Установить ссылку. Столбец для ФК '%s.%s'

source: Specify Referenced Column
ru: Укажите колонку со ссылками

source: Referenced Column Name:
ru: Имя столбца со ссылкой:

source: Add Column to FK '%s.%s'
ru: Добавить столбец в FK '%s.%s'

source: Remove Column from FK '%s.%s'
ru: Удалить столбец из FK '%s.%s'

source: Remove Column From FK '%s.%s'
ru: Удалить столбец из FK '%s.%s'

source: Toggle SQL generation for '%s.%s'
ru: Переключить генерацию SQL для '%s.%s'

source: You can't use a SET NULL action if one of the referencing columns is set to NOT NULL. Would you like to revert the change or remove the NOT NULL from the column attribute?
ru: Вы не можете использовать SET NULL действие, если один из столбцов со ссылками не является NULL. Вы хотите отменить изменение или удалить НЕ НЕСЕТ из атрибута столбца?

source: Remove NOT NULL
ru: НЕ УДАЛИТЬ

source: Remove NOT NULL for columns '%s'
ru: Удалить НЕ НУЛО для столбцов '%s'

source: Rename FK
ru: Переименовать FK

source: On Delete Action
ru: При удалении

source: Change ON DELETE for FK '%s.%s'
ru: Сменить НА УДАЛИТЬ для ФК '%s.%s'

source: On Update Action
ru: Действие при обновлении

source: Change ON UPDATE for FK '%s.%s'
ru: Изменить ОБНОВЛЕНИЕ для ФК '%s.%s'

source: Specify Referenced Table Manually
ru: Укажите ссылку на таблицу вручную

source: Qualified Table Name:
ru: Название таблицы:

source: Change Ref. Table for FK '%s.%s'
ru: Сменить таблицу для ФК '%s.%s'

source: Change Comment for FK '%s.%s'
ru: Изменить комментарий FK '%s.%s'

source: Delete selected
ru: Удалить выбранные

source: Rename Table to '%s'
ru: Переименовать таблицу в '%s'

source: Add Column '%s' to '%s'
ru: Добавить столбец '%s' ' в '%s'

source: Rename '%s.%s' to '%s'
ru: Переименовать '%s.%s' в '%s'

source: Remove '%s.%s'
ru: Удалить '%s.%s'

source: Add Foreign Key '%s' to '%s'
ru: Добавить внешний ключ '%s' ' ' '%s'

source: Remove Foreign Key '%s'.'%s'
ru: Удалить внешний ключ '%s'.'%s'

source: Add Index '%s' to '%s'
ru: Добавить индекс '%s' ' ' '%s'

source: Remove Index '%s'.'%s'
ru: Удалить индекс '%s'.'%s'

source: Type not supported
ru: Тип не поддерживается

source: Model downgrade
ru: Понижение модели

source: Export Inserts for %s
ru: Экспорт вставки для %s

source: Export inserts canceled
ru: Экспорт вставки отменены

source: Exported inserts to %s
ru: Экспортированные вставки в %s

source: Create Foreign Key
ru: Создать внешний ключ

source: Add Foreign Key
ru: Добавить внешний ключ

source: Rename Foreign Key
ru: Переименовать внешний ключ

source: Add Object Privilege to Role '%s'
ru: Добавить Привилегию роли '%s'

source: Remove Object Privilege to Role '%s'
ru: Удалить привилегию для роли '%s'

source: Add All Privileges for '%s' to Role '%s'
ru: Добавить все привилегии для '%s' ' '%s'

source: Remove Privileges for '%s' from Role '%s'
ru: Удалить привилегии для '%s' из роли '%s'

source: Add Schema '%s'
ru: Добавить схему '%s'

source: Add Tables Wildcard for '%s.*'
ru: Добавить таблицу шаблона для '%s.*'

source: Add All Tables in '%s'
ru: Добавить все таблицы в '%s'

source: Set Parent Role of '%s'
ru: Установить родительскую роль для '%s'

source: Add Object %s '%s' to Role '%s'
ru: Добавить объект %s '%s' ' ' к роли '%s'

source: Add Object '%s' to Role '%s'
ru: Добавить объект '%s' ' к роли '%s ' '

source: Remove object from Role '%s'
ru: Удалить объект из роли '%s'

source: Add Role to Object Privileges
ru: Добавить роль в объект привилегий

source: Remove Role from Object Privileges
ru: Удалить роль из привилегий объекта

source: Add object privilege to role
ru: Добавить привилегию объекта к роли

source: Remove object privilege from role
ru: Удалить права объекта из роли

source: Remove routine from routine group `%s`.%s`
ru: Удалить шаблон из группы рутин%s`.%s`

source: Add routine to routine group `%s`.%s`
ru: Добавить шаблон в рутинную группу `%s`.%s`

source: Processing object
ru: Обработка объекта

source: Delete Layer from View
ru: Удалить слой из просмотра

source: Updated Layer for '%s'
ru: Обновлен слой для '%s'

source: Expand Table
ru: Развернуть таблицу

source: Collapse Table
ru: Свернуть таблицу

source: Expand Table Indices
ru: Развернуть индексы таблиц

source: Collapse Table Indices
ru: Свернуть индексы таблиц

source: Expand Table Triggers
ru: Развернуть триггеры таблиц

source: Collapse Table Triggers
ru: Свернуть триггеры таблиц

source: Data is not UTF8 encoded and cannot be displayed.
ru: Данные не в кодировке UTF8 и не могут быть отображены.

source: Beautify/reformat the SQL script
ru: Beautif/reformat SQL-скрипт

source: Show the Find panel for the editor
ru: Показать панель Найти для редактора

source: Toggle display of invisible characters (spaces, tabs, newlines)
ru: Переключить отображение невидимых символов (пробелы, табуляции, новости)

source: Toggle wrapping of long lines (keep this off for large files)
ru: Переключить обертывание длинных строк (не отключать для больших файлов)

source: 1 error found
ru: Найдена 1 ошибка

source: %lu errors found
ru: Найдено %lu ошибок

source: Text
ru: Текст

source: Review the SQL Script to be Applied on the Database
ru: Обзор SQL-скрипта для применения в базе данных

source: Review SQL Script
ru: Обзор SQL-скрипта

source: Please review the following SQL script that will be applied to the database. Note that once applied, these statements may not be revertible without losing some of the data. You can also manually change the SQL statements before execution.
ru: Пожалуйста, просмотрите следующий SQL-скрипт, который будет применяться к базе данных. Обратите внимание, что после применения эти утверждения могут быть необратимыми без потери некоторых данных. Вы также можете вручную изменить операторы SQL перед выполнением.

source: If the currently connected server supports online DDL then use the selected algorithm as default. This setting can also be adjusted for each alter operation.
ru: Если подключенный в настоящее время сервер поддерживает онлайн-DDL, то используйте выбранный алгоритм по умолчанию. Этот параметр также можно настроить для каждой операции в режиме alter.

source: Lock Type:
ru: Тип блокировки:
